{
    "Item 1": {
        "text": [
            "°Item1.</td>\n<td>\n</td>\n<td>\nBusiness</td>\n<td>\n</td>\n<td>\n3</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nInformation about our Executive Officers</td>\n<td>\n</td>\n<td>\n20</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n°Item",
            "°Item 1\n\nNote About Forward-Looking Statements\nThis report includes estimates, projections, statements relating to our business plans, objectives, and expected operating results that are forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, Section27A of the Securities Act of 1933, and Section21E of the Securities Exchange Act of 1934. Forward-looking statements may appear throughout this report, including the following sections: Business (Part I, Item1 of this Form 10-K), Risk Factors (Part I, Item1A of this Form 10-K), and Managements Discussion and Analysis of Financial Condition and Results of Operations (Part II, Item7 of this Form 10-K). These forward-looking statements generally are identified by the words believe, project, expect, anticipate, estimate, intend, strategy, future, opportunity, plan, may, should, will, would, will be, will continue, will likely result, and similar expressions. Forward-looking statements are based on current expectations and assumptions that are subject to risks and uncertainties that may cause actual results to differ materially. We describe risks and uncertainties that could cause actual results and events to differ materially in Risk Factors, Managements Discussion and Analysis of Financial Condition and Results of Operations, and Quantitative and Qualitative Disclosures about Market Risk (Part II, Item7A of this Form 10-K). Readers are cautioned not to place undue reliance on forward-looking statements, which speak only as of the date they are made. We undertake no obligation to update or revise publicly any forward-looking statements, whether because of new information, future events, or otherwise.\nPART I\n°Item",
            "°Item 1\n\nThe Ambitions That Drive Us\nTo achieve our vision, our research and development efforts focus on three interconnected ambitions:\n<div>\n<table>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\nReinvent productivity and business processes.</td></tr></table></div>\n<div>\n<table>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\nBuild the intelligent cloud and intelligent edge platform.</td></tr></table></div>\n<div>\n<table>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\nCreate more personal computing.</td></tr></table></div>\nReinvent Productivity and Business Processes\nAt Microsoft, were providing technology and resources to help our customers navigate a remote environment. Were seeing our family of products play key roles in the ways the world is continuing to work, learn, and connect. \nOur growth depends on securely delivering continuous innovation and advancing our leading productivity and collaboration tools and services, including Office, Dynamics, and LinkedIn. Microsoft 365 brings together Office 365, Windows, and Enterprise Mobility + Security to help organizations empower their employees with AI-backed tools that unlock creativity, increase teamwork, and fuel innovation, all the while enabling compliance coverage and data protection. Microsoft Teams is enabling rapid digital transformation by giving people a single tool to chat, call, meet, and collaborate. Microsoft Viva is an employee experience platform that brings together communications, knowledge, learning, resources, and insights powered by Microsoft 365. Microsoft Relationship Sales solution brings together LinkedIn Sales Navigator and Dynamics to transform business to business sales through social selling. Dynamics 365 for Talent with LinkedIn Recruiter and Learning gives human resource professionals a complete solution to compete for talent. Microsoft Power Platform empowers employees to build custom applications, automate workflow, and analyze data no matter their technical expertise.\nThese scenarios represent a move to unlock creativity and discover new habits, while simplifying security and management. Organizations of all sizes have digitized business-critical functions, redefining what they can expect from their business applications. This creates an opportunity to reach new customers and increase usage and engagement with existing customers.\nBuild the Intelligent Cloud and Intelligent Edge Platform\nIn the new remote world, companies have accelerated their own digital transformation to empower their employees, optimize their operations, engage customers, and in some cases, change the very core of their products and services. Partnering with organizations on their digital transformation during this period is one of our largest opportunities and we are uniquely positioned to become the strategic digital transformation platform and partner of choice their success is our success.\nOur strategy requires continued investment in datacenters and other hybrid and edge infrastructure to support our services. Azure is a trusted cloud with comprehensive compliance coverage and AI-based security built in.\nOur cloud business benefits from three economies of scale: datacenters that deploy computational resources at significantly lower cost per unit than smaller ones datacenters that coordinate and aggregate diverse customer, geographic, and application demand patterns, improving the utilization of computing, storage, and network resources and multi-tenancy locations that lower application maintenance labor costs.\nThe Microsoft Cloud is the most comprehensive and trusted cloud, providing the best integration across the technology stack while offering openness, improving time to value, reducing costs, and increasing agility. Being a global-scale cloud, Azure uniquely offers hybrid consistency, developer productivity, AI capabilities, and trusted security and compliance. We see more emerging use cases and needs for compute and security at the edge and are accelerating our innovation across the spectrum of intelligent edge devices, from IoT sensors to gateway devices and edge hardware to build, manage, and secure edge workloads. With Azure Stack, organizations can extend Azure into their own datacenters to create a consistent stack across the public cloud and the intelligent edge. Our hybrid infrastructure consistency spans security, compliance, identity, and management, helping to support the real-world needs and evolving regulatory requirements of commercial customers and enterprises. Azure Arc simplifies governance and management by delivering a consistent multi-cloud and on-premises management platform. Security, compliance, identity, and management underlie our entire tech stack. We offer integrated, end-to-end capabilities to protect people and organizations. In April 2021, we entered into a definitive agreement to acquire Nuance Communications, Inc., a cloud and AI software provider with healthcare and enterprise AI experience. The acquisition will build on our industry-specific cloud offerings. \n4\n\nPART I\n°Item",
            "°Item 1\n\nOur Future Opportunity\nIn a time of great disruption and uncertainty, customers are looking to us to accelerate their own digital transformations as software and cloud computing play a huge role across every industry and around the world. We continue to develop complete, intelligent solutions for our customers that empower people to stay productive and collaborate, while safeguarding businesses and simplifying IT management. Our goal is to lead the industry in several distinct areas of technology over the long-term, which we expect will translate to sustained growth. We are investing significant resources in:\n<div>\n<table>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\nTransforming the workplace to deliver new modern, modular business applications to improve how people communicate, collaborate, learn, work, play, and interact with one another.</td></tr></table></div>\n<div>\n<table>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\nBuilding and running cloud-based services in ways that unleash new experiences and opportunities for businesses and individuals.</td></tr></table></div>\n<div>\n<table>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\nApplying AI to drive insights and act on our customers behalf by understanding and interpreting their needs using natural methods of communication.</td></tr></table></div>\n<div>\n<table>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\nUsing Windows to fuel our cloud business, grow our share of the PC market, and drive increased engagement with our services like Microsoft 365 Consumer, Teams, Edge, Bing, Xbox Game Pass, and more.</td></tr></table></div>\n<div>\n<table>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\nTackling security from all angles with our integrated, end-to-end solutions spanning security, compliance, identity, and management, across all clouds and platforms.</td></tr></table></div>\n<div>\n<table>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\nInventing new gaming experiences that bring people together around their shared love for games on any devices and pushing the boundaries of innovation with console and PC gaming by creating the next wave of entertainment.</td></tr></table></div>\nOur future growth depends on our ability to transcend current product category definitions, business models, and sales motions. We have the opportunity to redefine what customers and partners can expect and are working to deliver new solutions that reflect the best of Microsoft.\nCOVID-19\nIn March 2020, the World Health Organization declared the outbreak of COVID-19 to be a pandemic. The COVID-19 pandemic continues to have widespread and unpredictable impacts on global society, economies, financial markets, and business practices, and continues to impact our business operations, including our employees, customers, partners, and communities. Refer to Managements Discussion and Analysis of Financial Condition and Results of Operations (Part II, Item7 of this Form 10-K) for further discussion regarding the impact of COVID-19 on our fiscal year 2021 financial results. The extent to which the COVID-19 pandemic impacts our business going forward will depend on numerous evolving factors we cannot reliably predict. Refer to Risk Factors (Part I, Item1A of this Form 10-K) for a discussion of these factors and other risks.\nCorporate Social Responsibility\nCommitment to Sustainability\nWe work to ensure that technology is inclusive, trusted, and increases sustainability. We are accelerating progress toward a more sustainable future by reducing our environmental footprint, advancing research, helping our customers build sustainable solutions, and advocating for policies that benefit the environment. In January 2020, we announced a bold commitment and detailed plan to be carbon negative by 2030, and to remove from the environment by 2050 all the carbon we have emitted since our founding in 1975. This included a commitment to invest $1 billion over four years in new technologies and innovative climate solutions. We built on this pledge by adding commitments to be water positive by 2030, zero waste by 2030, and to protect ecosystems by developing a Planetary Computer. We also help our suppliers and customers around the world use Microsoft technology to reduce their own carbon footprint. \nIn January 2021, we announced that in fiscal year 2020 we reduced Microsofts carbon emissions by 586,683 metric tons. We purchased the removal of 1.3 million metric tons of carbon from 26 projects around the world. Furthermore, we shared a commitment to transparency by subjecting the data in our annual sustainability report to third-party review and to accountability by including progress on sustainability goals as a factor in determining executive pay.\n6\n\nPART I\n°Item",
            "°Item 1\n\nHUMAN CAPITAL RESOURCES\nOverview\nMicrosoft aims to recruit, develop, and retain diverse, world-changing talent. To foster their and our success, we seek to create an environment where people can do their best work  a place where they can proudly be their authentic selves, guided by our values, and where they know their needs can be met. We strive to maximize the potential of our human capital resources by creating a respectful, rewarding, and inclusive work environment that enables our global employees to create products and services that further our mission to empower every person and every organization on the planet to achieve more.\nAs of June 30, 2021, we employed approximately 181,000 people on a full-time basis, 103,000 in the U.S. and 78,000 internationally. Of the total employed people, 67,000 were in operations, including manufacturing, distribution, product support, and consulting services 60,000 were in product research and development 40,000 were in sales and marketing and 14,000 were in general and administration. Certain of our employees are subject to collective bargaining agreements.\nOur Culture\nMicrosofts culture is grounded in the growth mindset. This means everyone is on a continuous journey to learn and grow. We believe potential can be nurtured and is not pre-determined, and we should always be learning and curious - trying new things without fear of failure. We identified four attributes that allow growth mindset to flourish:\n<div>\n<table>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\nObsessing over what matters to our customers. </td></tr></table></div>\n<div>\n<table>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\nBecoming more diverse and inclusive in everything we do. </td></tr></table></div>\n<div>\n<table>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\nOperating as one company, One Microsoft, instead of multiple siloed businesses. </td></tr></table></div>\n<div>\n<table>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\nMaking a difference in the lives of each other, our customers, and the world around us. </td></tr></table></div>\nOur employee listening systems enable us to gather feedback directly from our workforce to inform our programs and employee needs globally. 88% of employees globally participated in our fiscal year 2021 MS Poll engagement survey, which covers a variety of topics such as inclusion, pay and benefits, and learning and development. Throughout the fiscal year, we also collect nearly 75,000 Daily Pulse employee survey responses. During fiscal year 2021, our Daily Pulse surveys gave us invaluable insights into ways we could support employees through the COVID-19 pandemic and addressing racial injustice. In addition to poll and pulse surveys, we gain insights through onboarding and exit surveys, internal Yammer channels, employee QA sessions, and AskHR Service support.\nDiversity and Inclusion\nAt Microsoft we have an inherently inclusive mission: to empower every person and every organization on the planet to achieve more. We think of diversity and inclusion as core to our business model, informing our actions to impact economies and people around the world. There are billions of people who want to achieve more, but have a different set of circumstances, abilities, and backgrounds that often limit access to opportunity and achievement. The better we represent that diversity inside Microsoft, the more effectively we can innovate for those we seek to empower.\nWe strive to include others by holding ourselves accountable for diversity, driving global systemic change in our workplace and workforce, and creating an inclusive work environment. Through this commitment we can allow everyone the chance to be their authentic selves and do their best work every day. We support multiple highly active Employee Resource Groups for women, families, racial and ethnic minorities, military, people with disabilities, or who identify as LGBTQI+, where employees can go for support, networking, and community-building. As described in our 2020 Proxy Statement, annual performance and compensation reviews of our senior leadership team include an evaluation of their contributions to employee culture and diversity. To ensure accountability over time, we publicly disclose our progress on a multitude of workforce metrics including:\n<div>\n<table>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\nDetailed breakdowns of gender, racial, and ethnic minority representation in our employee population, with data by job types, levels, and segments of our business. </td></tr></table></div>\n<div>\n<table>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\nOur EEO-1 report (equal employment opportunity).</td></tr></table></div>\n<div>\n<table>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\nDisability representation.</td></tr></table></div>\n8\n\nPART I\n°Item",
            "°Item 1\n\n<div>\n<table>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\nNew employee orientation covering a range of topics including company values, culture, and Standards of Business Conduct, as well as ongoing onboarding program.</td></tr></table></div>\nOur employees embrace the growth mindset and take advantage of the formal learning opportunities as well as thousands of informal and on-the-job learning opportunities. In terms of formal on-line learning solutions, in fiscal year 2021 our employees completed over 5 million courses, averaging over 18 hours per employee. Given our focus on understanding core company beliefs and compliance topics, all employees complete required learning programs like Standards of Business Conduct, Privacy, Unconscious Bias, and preventing harassment courses. Our corporate learning portal has over 100,000 average monthly active users. All of our approximately 23,000 people managers must complete between 25-30 hours of required manager capability and excellence training and are assigned ongoing required training each year. In addition, all employees complete skills training based on the profession they are in each year.\nNew Ways of Working \nThe global pandemic has accelerated our capabilities and culture with respect to flexible work. Microsoft has introduced a Hybrid Workplace Flexibility Guide to better support managers and employees as they adapt to new ways of working that shift paradigms, embrace flexibility, promote inclusion, and drive innovation. Our ongoing survey data shows employees value the flexibility related to work location, work site, and work hours, and while many indicate they intend to return to a worksite once conditions permit, they also intend to adjust hours or spend some portions of workweeks working remotely. We are focused on building capabilities to support a variety of workstyles where individuals, teams, and our business can be successful.\nOPERATING SEGMENTS\nWe operate our business and report our financial performance using three segments: Productivity and Business Processes, Intelligent Cloud, and More Personal Computing. Our segments provide management with a comprehensive financial view of our key businesses. The segments enable the alignment of strategies and objectives across the development, sales, marketing, and services organizations, and they provide a framework for timely and rational allocation of resources within businesses.\nAdditional information on our operating segments and geographic and product information is contained in Note 19  Segment Information and Geographic Data of the Notes to Financial Statements (Part II, Item 8 of this Form 10-K).\nOur reportable segments are described below.\nProductivity and Business Processes\nOur Productivity and Business Processes segment consists of products and services in our portfolio of productivity, communication, and information services, spanning a variety of devices and platforms. This segment primarily comprises:\n<div>\n<table>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\nOffice Commercial (Office 365 subscriptions, the Office 365 portion of Microsoft 365 Commercial subscriptions, and Office licensed on-premises), comprising Office, Exchange, SharePoint, Microsoft Teams, Office 365 Security and Compliance, and Skype for Business.</td></tr></table></div>\n<div>\n<table>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\nOffice Consumer, including Microsoft 365 Consumer subscriptions and Office licensed on-premises, and Office Consumer Services, including Skype, Outlook.com, and OneDrive.</td></tr></table></div>\n<div>\n<table>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\nLinkedIn, including Talent Solutions, Marketing Solutions, Premium Subscriptions, Sales Solutions, and Learning Solutions.</td></tr></table></div>\n<div>\n<table>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\nDynamics business solutions, including Dynamics 365, comprising a set of intelligent, cloud-based applications across ERP, CRM, Customer Insights, Power Apps, and Power Automate and on-premises ERP and CRM applications.</td></tr></table></div>\n10\n\nPART I\n°Item",
            "°Item 1\n\nCompetition\nCompetitors to Office include software and global application vendors, such as Apple, Cisco Systems, Facebook, Google, IBM, Okta, Proofpoint, Slack, Symantec, Zoom, and numerous web-based and mobile application competitors as well as local application developers. Apple distributes versions of its pre-installed application software, such as email and calendar products, through its PCs, tablets, and phones. Cisco Systems is using its position in enterprise communications equipment to grow its unified communications business. Google provides a hosted messaging and productivity suite. Slack provides teamwork and collaboration software. Zoom offers videoconferencing and cloud phone solutions. Skype for Business and Skype also compete with a variety of instant messaging, voice, and video communication providers, ranging from start-ups to established enterprises. Okta, Proofpoint, and Symantec provide security solutions across email security, information protection, identity, and governance. Web-based offerings competing with individual applications have also positioned themselves as alternatives to our products and services. We compete by providing powerful, flexible, secure, integrated industry-specific, and easy-to-use productivity and collaboration tools and services that create comprehensive solutions and work well with technologies our customers already have both on-premises or in the cloud.\nLinkedIn faces competition from online professional networks, recruiting companies, talent management companies, and larger companies that are focusing on talent management and human resource services job boards traditional recruiting firms and companies that provide learning and development products and services. Marketing Solutions competes with online and offline outlets that generate revenue from advertisers and marketers, and Sales Solutions competes with online and offline outlets for companies with lead generation and customer intelligence and insights.\nDynamics competes with cloud-based and on-premises business solution providers such as Oracle, Salesforce.com, and SAP.\nIntelligent Cloud\nOur Intelligent Cloud segment consists of our public, private, and hybrid server products and cloud services that can power modern business and developers. This segment primarily comprises:\n<div>\n<table>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\nServer products and cloud services, including Azure SQL Server, Windows Server, Visual Studio, System Center, and related Client Access Licenses (CALs) and GitHub.</td></tr></table></div>\n<div>\n<table>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\nEnterprise Services, including Premier Support Services and Microsoft Consulting Services.</td></tr></table></div>\nServer Products and Cloud Services\nAzure is a comprehensive set of cloud services that offer developers, IT professionals, and enterprises freedom to build, deploy, and manage applications on any platform or device. Customers can use Azure through our global network of datacenters for computing, networking, storage, mobile and web application services, AI, IoT, cognitive services, and machine learning. Azure enables customers to devote more resources to development and use of applications that benefit their organizations, rather than managing on-premises hardware and software. Azure revenue is mainly affected by infrastructure-as-a-service and platform-as-a-service consumption-based services, and per user-based services such as Enterprise Mobility + Security.\nOur server products are designed to make IT professionals, developers, and their systems more productive and efficient. Server software is integrated server infrastructure and middleware designed to support software applications built on the Windows Server operating system. This includes the server platform, database, business intelligence, storage, management and operations, virtualization, service-oriented architecture platform, security, and identity software. We also license standalone and software development lifecycle tools for software architects, developers, testers, and project managers. GitHub provides a collaboration platform and code hosting service for developers. Server products revenue is mainly affected by purchases through volume licensing programs, licenses sold to original equipment manufacturers (OEM), and retail packaged products. CALs provide access rights to certain server products, including SQL Server and Windows Server, and revenue is reported along with the associated server product. \nEnterprise Services\nEnterprise Services, including Premier Support Services and Microsoft Consulting Services, assist customers in developing, deploying, and managing Microsoft server and desktop solutions and provide training and certification to developers and IT professionals on various Microsoft products.\n12\n\nPART I\n°Item",
            "°Item 1\n\nWindows\nThe Windows operating system is designed to deliver a more personal computing experience for users by enabling consistency of experience, applications, and information across their devices. Windows OEM revenue is impacted significantly by the number of Windows operating system licenses purchased by OEMs, which they pre-install on the devices they sell. In addition to computing device market volume, Windows OEM revenue is impacted by: \n<div>\n<table>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\nThe mix of computing devices based on form factor and screen size. </td></tr></table></div>\n<div>\n<table>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\nDifferences in device market demand between developed markets and growth markets. </td></tr></table></div>\n<div>\n<table>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\nAttachment of Windows to devices shipped. </td></tr></table></div>\n<div>\n<table>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\nCustomer mix between consumer, small and medium businesses, and large enterprises. </td></tr></table></div>\n<div>\n<table>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\nChanges in inventory levels in the OEM channel. </td></tr></table></div>\n<div>\n<table>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\nPricing changes and promotions, pricing variation that occurs when the mix of devices manufactured shifts from local and regional system builders to large multinational OEMs, and different pricing of Windows versions licensed.</td></tr></table></div>\n<div>\n<table>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\nConstraints in the supply chain of device components.</td></tr></table></div>\n<div>\n<table>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\nPiracy.</td></tr></table></div>\nWindows Commercial revenue, which includes volume licensing of the Windows operating system and Windows cloud services such as Microsoft Defender Advanced Threat Protection, is affected mainly by the demand from commercial customers for volume licensing and Software Assurance (SA), as well as advanced security offerings. Windows Commercial revenue often reflects the number of information workers in a licensed enterprise and is relatively independent of the number of PCs sold in a given year. \nPatent licensing includes our programs to license patents we own for use across a broad array of technology areas, including mobile devices and cloud offerings.\nWindows IoT extends the power of Windows and the cloud to intelligent systems by delivering specialized operating systems, tools, and services for use in embedded devices. \nMSN advertising includes both native and display ads. \nDevices\nWe design and sell devices, including Surface and PC accessories. Our devices are designed to enable people and organizations to connect to the people and content that matter most using Windows and integrated Microsoft products and services. Surface is designed to help organizations, students, and consumers be more productive. Growth in Devices is dependent on total PC shipments, the ability to attract new customers, our product roadmap, and expanding into new categories.\nGaming\nOur gaming platform is designed to provide a variety of entertainment through a unique combination of content, community, and cloud. Our exclusive game content is created through Xbox Game Studios, a collection of first-party studios creating iconic and differentiated gaming experiences. We continue to invest in new gaming studios and content to expand our IP roadmap and leverage new content creators. These unique gaming experiences are the cornerstone of Xbox Game Pass, a subscription service and gaming community with access to a curated library of over 100 first- and third-party console and PC titles.\nThe gamer remains at the heart of the Xbox ecosystem. We continue to open new opportunities for gamers to engage both on- and off-console with both the launch of Xbox Cloud Gaming, our game streaming service, and continued investment in gaming hardware. Xbox Cloud Gaming utilizes Microsofts Azure cloud technology to allow direct and on-demand streaming of games to PCs, consoles, and mobile devices, enabling gamers to take their favorites games with them and play on the device most convenient to them. \n14\n\nPART I\n°Item",
            "°Item 1\n\nRESEARCH AND DEVELOPMENT \nProduct and Service Development, and Intellectual Property \nWe develop most of our products and services internally through the following engineering groups. \n<div>\n<table>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\nCloud and AI, focuses on making IT professionals, developers, and their systems more productive and efficient through development of cloud infrastructure, server, database, CRM, ERP, management and development tools, AI cognitive services, and other business process applications and services for enterprises.</td></tr></table></div>\n<div>\n<table>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\nExperiences and Devices, focuses on instilling a unifying product ethos across our end-user experiences and devices, including Office, Windows, Enterprise Mobility + Security, and Surface.</td></tr></table></div>\n<div>\n<table>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\nAI and Research, focuses on our AI innovations and other forward-looking research and development efforts spanning infrastructure, services, applications, and search.</td></tr></table></div>\n<div>\n<table>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\nLinkedIn, focuses on our services that transform the way customers hire, market, sell, and learn. </td></tr></table></div>\n<div>\n<table>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\nGaming, focuses on developing hardware, content, and services across a large range of platforms to help grow our user base through game experiences and social interaction.</td></tr></table></div>\nInternal development allows us to maintain competitive advantages that come from product differentiation and closer technical control over our products and services. It also gives us the freedom to decide which modifications and enhancements are most important and when they should be implemented. We strive to obtain information as early as possible about changing usage patterns and hardware advances that may affect software and hardware design. Before releasing new software platforms, and as we make significant modifications to existing platforms, we provide application vendors with a range of resources and guidelines for development, training, and testing. Generally, we also create product documentation internally. \nWe protect our intellectual property investments in a variety of ways. We work actively in the U.S. and internationally to ensure the enforcement of copyright, trademark, trade secret, and other protections that apply to our software and hardware products, services, business plans, and branding. We are a leader among technology companies in pursuing patents and currently have a portfolio of over 65,000 U.S. and international patents issued and over 21,000 pending worldwide. While we employ much of our internally-developed intellectual property exclusively in our products and services, we also engage in outbound licensing of specific patented technologies that are incorporated into licensees products. From time to time, we enter into broader cross-license agreements with other technology companies covering entire groups of patents. We may also purchase or license technology that we incorporate into our products and services. At times, we make select intellectual property broadly available at no or low cost to achieve a strategic objective, such as promoting industry standards, advancing interoperability, supporting societal and/or environmental efforts, or attracting and enabling our external development community. Our increasing engagement with open source software will also cause us to license our intellectual property rights broadly in certain situations.\nWhile it may be necessary in the future to seek or renew licenses relating to various aspects of our products, services, and business methods, we believe, based upon past experience and industry practice, such licenses generally can be obtained on commercially reasonable terms. We believe our continuing research and product development are not materially dependent on any single license or other agreement with a third party relating to the development of our products. \nInvesting in the Future \nOur success is based on our ability to create new and compelling products, services, and experiences for our users, to initiate and embrace disruptive technology trends, to enter new geographic and product markets, and to drive broad adoption of our products and services. We invest in a range of emerging technology trends and breakthroughs that we believe offer significant opportunities to deliver value to our customers and growth for the Company. Based on our assessment of key technology trends, we maintain our long-term commitment to research and development across a wide spectrum of technologies, tools, and platforms spanning digital work and life experiences, cloud computing, AI, devices, and operating systems. \nWhile our main product research and development facilities are located in Redmond, Washington, we also operate research and development facilities in other parts of the U.S. and around the world. This global approach helps us remain competitive in local markets and enables us to continue to attract top talent from across the world. \n16\n\nPART I\n°Item",
            "°Item 1\n\nWe distribute our retail packaged products primarily through independent non-exclusive distributors, authorized replicators, resellers, and retail outlets. Individual consumers obtain these products primarily through retail outlets. We distribute our devices through third-party retailers. We have a network of field sales representatives and field support personnel that solicit orders from distributors and resellers, and provide product training and sales support. \nOur Dynamics business solutions are also licensed to enterprises through a global network of channel partners providing vertical solutions and specialized services. \nLICENSING OPTIONS \nWe offer options for organizations that want to purchase our cloud services, on-premises software, and SA. We license software to organizations under volume licensing agreements to allow the customer to acquire multiple licenses of products and services instead of having to acquire separate licenses through retail channels. We use different programs designed to provide flexibility for organizations of various sizes. While these programs may differ in various parts of the world, generally they include those discussed below. \nSA conveys rights to new software and upgrades for perpetual licenses released over the contract period. It also provides support, tools, training, and other licensing benefits to help customers deploy and use software efficiently. SA is included with certain volume licensing agreements and is an optional purchase with others.\nVolume Licensing Programs\nEnterprise Agreement \nEnterprise Agreements offer large organizations a manageable volume licensing program that gives them the flexibility to buy cloud services and software licenses under one agreement. Enterprise Agreements are designed for medium or large organizations that want to license cloud services and on-premises software organization-wide over a three-year period. Organizations can elect to purchase perpetual licenses or subscribe to licenses. SA is included. \nMicrosoft Product and Services Agreement \nMicrosoft Product and Services Agreements are designed for medium and large organizations that want to license cloud services and on-premises software as needed, with no organization-wide commitment, under a single, non-expiring agreement. Organizations purchase perpetual licenses or subscribe to licenses. SA is optional for customers that purchase perpetual licenses. \nOpen\nOpen agreements are a simple, cost-effective way to acquire the latest Microsoft technology. Open agreements are designed for small and medium organizations that want to license cloud services and on-premises software over a one- to three-year period. Under the Open agreements, organizations purchase perpetual licenses and SA is optional. Under Open Value agreements, organizations can elect to purchase perpetual licenses or subscribe to licenses and SA is included. \n18\n\nPART I\n°Item",
            "°Item 1\n\nINFORMATION ABOUT OUR EXECUTIVE OFFICERS\nOur executive officers as of July 29, 2021 were as follows:\n\n<div>\n<table>\n<tr>\n<td>\nName</td>\n<td>\n</td>\n<td>\nAge</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nPosition with the Company</td>\n</tr>\n<tr>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nSatyaNadella</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n53</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nChairman of the Board and Chief Executive Officer</td>\n</tr>\n<tr>\n<td>\nJudson Althoff</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n48</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nExecutive Vice President and Chief Commercial Officer</td>\n</tr>\n<tr>\n<td>\nChristopher C. Capossela</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n51</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nExecutive Vice President, Marketing and Consumer Business, and Chief Marketing Officer</td>\n</tr>\n<tr>\n<td>\nKathleen T. Hogan</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n55</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nExecutive Vice President, Human Resources</td>\n</tr>\n<tr>\n<td>\nAmy E. Hood</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n49</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nExecutive Vice President, Chief Financial Officer</td>\n</tr>\n<tr>\n<td>\nBradford L. Smith</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n62</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nPresident and Chief Legal Officer</td>\n</tr>\n<tr>\n<td>\nChristopher D. Young</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n49</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nExecutive Vice President, Business Development, Strategy, and Ventures</td>\n</tr>\n<tr>\n<td>\n</td>\n</tr>\n</table></div>\nMr.Nadella was appointed Chairman of the Board in June 2021 and Chief Executive Officer in February 2014. He served as Executive Vice President, Cloud and Enterprise from July 2013 until that time. From 2011 to 2013, Mr.Nadella served as President, Server and Tools. From 2009 to 2011, he was Senior Vice President, Online Services Division. From 2008 to 2009, he was Senior Vice President, Search, Portal, and Advertising. Since joining Microsoft in 1992, Mr.Nadellas roles also included Vice President of the Business Division. Mr. Nadella also serves on the Board of Directors of Starbucks Corporation.\nMr. Althoff was appointed Executive Vice President and Chief Commercial Officer in July 2021. He served as Executive Vice President, Worldwide Commercial Business from July 2017 until that time. Prior to that, Mr. Althoff served as the President of Microsoft North America. Mr. Althoff joined Microsoft in March 2013 as President of Microsoft North America.\nMr.Capossela was appointed Executive Vice President, Marketing and Consumer Business, and Chief Marketing Officer in July 2016.He had served as Executive Vice President, Chief Marketing Officer since March 2014. Previously, he served as the worldwide leader of the Consumer Channels Group, responsible for sales and marketing activities with OEMs, operators, and retail partners.In his more than 28 years at Microsoft, Mr.Capossela has held a variety of marketing leadership roles in the Microsoft Office Division.He was responsible for marketing productivity solutions including Microsoft Office, Office 365, SharePoint, Exchange, Skype for Business, Project, and Visio.\nMs. Hogan was appointed Executive Vice President, Human Resources in November 2014. Prior to that Ms. Hogan was Corporate Vice President of Microsoft Services. She also served as Corporate Vice President of Customer Service and Support. Ms. Hogan joined Microsoft in 2003. Ms. Hogan also serves on the Board of Directors of Alaska Air Group, Inc.\nMs.Hood was appointed Executive Vice President and Chief Financial Officer in July 2013, subsequent to her appointment as Chief Financial Officer in May 2013. From 2010 to 2013, Ms.Hood was Chief Financial Officer of the Microsoft Business Division. From 2006 through 2009, Ms.Hood was General Manager, Microsoft Business Division Strategy.Since joining Microsoft in 2002, Ms.Hood has also held finance-related positions in the Server and Tools Business and the corporate finance organization. Ms. Hood also serves on the Board of Directors of 3M Corporation.\nMr.Smith was appointed President and Chief Legal Officer in September 2015. He served as Executive Vice President, General Counsel, and Secretary from 2011 to 2015, and served as Senior Vice President, General Counsel, and Secretary from 2001 to 2011. Mr.Smith was also named Chief Compliance Officer in 2002. Since joining Microsoft in 1993, he was Deputy General Counsel for Worldwide Sales and previously was responsible for managing the European Law and Corporate Affairs Group, based in Paris. Mr. Smith also serves on the Board of Directors of Netflix, Inc.\nMr. Young joined Microsoft in November 2020 as Executive Vice President, Business Development, Strategy, and Ventures. Prior to Microsoft, he served as the Chief Executive Officer of McAfee, LLC from 2017 to 2020, and served as a Senior Vice President and General Manager of Intel Security Group from 2014 until 2017, when he led the initiative to spin out McAfee into a standalone company. Mr. Young also serves on the Board of Directors of American Express Company.\n20\n\nPART I\n°Item"
        ]
    },
    "Item 1A": {
        "text": [
            "°Item1A.</td>\n<td>\n</td>\n<td>\nRisk Factors</td>\n<td>\n</td>\n<td>\n22</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n°Item",
            "°Item 1A\n\n°Item",
            "°Item 1A\n\nBusiness model competition \nCompanies compete with us based on a growing variety of business models. \n<div>\n<table>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\nEven as we transition more of our business to infrastructure-, platform-, and software-as-a-service business model, the license-based proprietary software model generates a substantial portion of our software revenue. We bear the costs of converting original ideas into software products through investments in research and development, offsetting these costs with the revenue received from licensing our products. Many of our competitors also develop and sell software to businesses and consumers under this model. </td></tr></table></div>\n<div>\n<table>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\nOther competitors develop and offer free applications, online services and content, and make money by selling third-party advertising. Advertising revenue funds development of products and services these competitors provide to users at no or little cost, competing directly with our revenue-generating products. </td></tr></table></div>\n<div>\n<table>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\nSome companies compete with us by modifying and then distributing open source software at little or no cost to end users, and earning revenue on advertising or integrated products and services. These firms do not bear the full costs of research and development for the open source software. Some open source software mimics the features and functionality of our products. </td></tr></table></div>\nThe competitive pressures described above may cause decreased sales volumes, price reductions, and/or increased operating costs, such as for research and development, marketing, and sales incentives. This may lead to lower revenue, gross margins, and operating income. \nOur increasing focus on cloud-based services presents execution and competitive risks.A growing part of our business involves cloud-based services available across the spectrum of computing devices. Our strategic vision is to compete and grow by building best-in-class platforms and productivity services for an intelligent cloud and an intelligent edge infused with artificial intelligence (AI). At the same time, our competitors are rapidly developing and deploying cloud-based services for consumers and business customers. Pricing and delivery models are evolving. Devices and form factors influence how users access services in the cloud and sometimes the users choice of which cloud-based services to use. We are devoting significant resources to develop and deploy our cloud-based strategies. The Windows ecosystem must continue to evolve with this changing environment. We embrace cultural and organizational changes to drive accountability and eliminate obstacles to innovation. Our intelligent cloud and intelligent edge worldview is connected with the growth of the Internet of Things (IoT). Our success in the IoT will depend on the level of adoption of our offerings such as Azure, Azure Stack, Azure IoT Edge, and Azure Sphere. We may not establish market share sufficient to achieve scale necessary to achieve our business objectives.\nBesides software development costs, we are incurring costs to build and maintain infrastructure to support cloud computing services. These costs will reduce the operating margins we have previously achieved. Whether we succeed in cloud-based services depends on our execution in several areas, including: \n<div>\n<table>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\nContinuing to bring to market compelling cloud-based experiences that generate increasing traffic and market share. </td></tr></table></div>\n<div>\n<table>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\nMaintaining the utility, compatibility, and performance of our cloud-based services on the growing array of computing devices, including PCs, smartphones, tablets, gaming consoles, and other devices, as well as sensors and other IoT endpoints. </td></tr></table></div>\n<div>\n<table>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\nContinuing to enhance the attractiveness of our cloud platforms to third-party developers. </td></tr></table></div>\n<div>\n<table>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\nEnsuring our cloud-based services meet the reliability expectations of our customers and maintain the security of their data as well as help them meet their own compliance needs. </td></tr></table></div>\n<div>\n<table>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\nMaking our suite of cloud-based services platform-agnostic, available on a wide range of devices and ecosystems, including those of our competitors. </td></tr></table></div>\nIt is uncertain whether our strategies will attract the users or generate the revenue required to succeed. If we are not effective in executing organizational and technical changes to increase efficiency and accelerate innovation, or if we fail to generate sufficient usage of our new products and services, we may not grow revenue in line with the infrastructure and development investments described above. This may negatively impact gross margins and operating income. \n23\n\nPART I\n°Item",
            "°Item 1A\n\nCYBERSECURITY, DATA PRIVACY, AND PLATFORM ABUSE RISKS\nCyberattacks and security vulnerabilities could lead to reduced revenue, increased costs, liability claims, or harm to our reputation or competitive position. \nSecurity of our information technology\nThreats to IT security can take a variety of forms. Individual and groups of hackers and sophisticated organizations, including state-sponsored organizations or nation-states, continuously undertake attacks that pose threats to our customers and our IT.These actors may use a wide variety of methods, which may include developing and deploying malicious software or exploiting vulnerabilities in hardware, software, or other infrastructure in order to attack our products and services or gain access to our networks and datacenters, using social engineering techniques to induce our employees, users, partners, or customers to disclose passwords or other sensitive information or take other actions to gain access to our data or our users or customers data, or acting in a coordinated manner to launch distributed denial of service or other coordinated attacks. Nation state and state sponsored actors can deploy significant resources to plan and carry out exploits. Inadequate account security practices may also result in unauthorized access to confidential data. For example, system administrators may fail to timely remove employee account access when no longer appropriate. Employees or third parties may intentionally compromise our or our users security or systems or reveal confidential information. Malicious actors may employ the IT supply chain to introduce malware through software updates or compromised supplier accounts or hardware.\nCyberthreats are constantly evolving and becoming increasingly sophisticated and complex, increasing the difficulty of detecting and successfully defending against them. We may have no current capability to detect certain vulnerabilities, which may allow them to persist in the environment over long periods of time. Cyberthreats can have cascading impacts that unfold with increasing speed across our internal networks and systems and those of our partners and customers. Breaches of our facilities, network, or data security could disrupt the security of our systems and business applications, impair our ability to provide services to our customers and protect the privacy of their data, result in product development delays, compromise confidential or technical business information harming our reputation or competitive position, result in theft or misuse of our intellectual property or other assets, require us to allocate more resources to improve technologies or remediate the impacts of attacks, or otherwise adversely affect our business.\nThe cyberattacks uncovered in late 2020 known as Solorigate or Nobelium are an example of a supply chain attack where malware was introduced to a software providers customers, including us, through software updates. The attackers were later able to create false credentials that appeared legitimate to certain customers systems. We may be targets of further attacks similar to Solorigate/Nobelium as both a supplier and consumer of IT.\nIn addition, our internal IT environment continues to evolve. Often, we are early adopters of new devices and technologies. We embrace new ways of sharing data and communicating internally and with partners and customers using methods such as social networking and other consumer-oriented technologies. Our business policies and internal security controls may not keep pace with these changes as new threats emerge.\n25\n\nPART I\n°Item",
            "°Item 1A\n\nThe cost of measures to protect products and customer-facing services could reduce our operating margins. If we fail to do these things well, actual or perceived security vulnerabilities in our products and services, data corruption issues, or reduced performance could harm our reputation and lead customers to reduce or delay future purchases of products or subscriptions to services, or to use competing products or services. Customers may also spend more on protecting their existing computer systems from attack, which could delay adoption of additional products or services. Customers, and third parties granted access to their systems, may fail to update their systems, continue to run software or operating systems we no longer support, or may fail timely to install or enable security patches, or may otherwise fail to adopt adequate security practices. Any of these could adversely affect our reputation and revenue. Actual or perceived vulnerabilities may lead to claims against us. Our license agreements typically contain provisions that eliminate or limit our exposure to liability, but there is no assurance these provisions will withstand legal challenges. At times, to achieve commercial objectives, we may enter into agreements with larger liability exposure to customers. \nOur products operate in conjunction with and are dependent on products and components across a broad ecosystem of third parties. If there is a security vulnerability in one of these components, and if there is a security exploit targeting it, we could face increased costs, liability claims, reduced revenue, or harm to our reputation or competitive position.\nDisclosure and misuse of personal data could result in liability and harm our reputation.As we continue to grow the number and scale of our cloud-based offerings, we store and process increasingly large amounts of personally identifiable information of our customers and users. The continued occurrence of high-profile data breaches provides evidence of an external environment increasingly hostile to information security. Despite our efforts to improve the security controls across our business groups and geographies, it is possible our security controls over personal data, our training of employees and third parties on data security, and other practices we follow may not prevent the improper disclosure or misuse of customer or user data we or our vendors store and manage. In addition, third parties who have limited access to our customer or user data may use this data in unauthorized ways. Improper disclosure or misuse could harm our reputation, lead to legal exposure to customers or users, or subject us to liability under laws that protect personal data, resulting in increased costs or loss of revenue. Our software products and services also enable our customers and users to store and process personal data on-premises or, increasingly, in a cloud-based environment we host. Government authorities can sometimes require us to produce customer or user data in response to valid legal orders. In the U.S. and elsewhere, we advocate for transparency concerning these requests and appropriate limitations on government authority to compel disclosure. Despite our efforts to protect customer and user data, perceptions that the collection, use, and retention of personal information is not satisfactorily protected could inhibit sales of our products or services and could limit adoption of our cloud-based solutions by consumers, businesses, and government entities. Additional security measures we may take to address customer or user concerns, or constraints on our flexibility to determine where and how to operate datacenters in response to customer or user expectations or governmental rules or actions, may cause higher operating expenses or hinder growth of our products and services. \nWe may not be able to protect information in our products and services from use by others. LinkedIn and other Microsoft products and services contain valuable information and content protected by contractual restrictions or technical measures. In certain cases, we have made commitments to our members and users to limit access to or use of this information. Changes in the law or interpretations of the law may weaken our ability to prevent third parties from scraping or gathering information or content through use of bots or other measures and using it for their own benefit, thus diminishing the value of our products and services.\nAbuse of our platforms may harm our reputation or user engagement. \nAdvertising, professional, and social platform abuses \nFor platform products and services that provide content or host ads that come from or can be influenced by third parties, including GitHub, LinkedIn, Microsoft Advertising, MSN, and Xbox, our reputation or user engagement may be negatively affected by activity that is hostile or inappropriate. This activity may come from users impersonating other people or organizations, use of our products or services to spread terrorist or violent extremist content or to disseminate information that may be viewed as misleading or intended to manipulate the opinions of our users, or the use of our products or services that violates our terms of service or otherwise for objectionable or illegal ends. Preventing or responding to these actions may require us to make substantial investments in people and technology and these investments may not be successful, adversely affecting our business and consolidated financial statements.\n27\n\nPART I\n°Item",
            "°Item 1A\n\nOur software products and services also may experience quality or reliability problems. The highly sophisticated software we develop may contain bugs and other defects that interfere with their intended operation. Our customers increasingly rely on us for critical business functions and multiple workloads. Many of our products and services are interdependent with one another. Each of these circumstances potentially magnifies the impact of quality or reliability issues. Any defects we do not detect and fix in pre-release testing could cause reduced sales and revenue, damage to our reputation, repair or remediation costs, delays in the release of new products or versions, or legal liability. Although our license agreements typically contain provisions that eliminate or limit our exposure to liability, there is no assurance these provisions will withstand legal challenge.\nWe acquire some device and datacenter components from sole suppliers. Our competitors use some of the same suppliers and their demand for hardware components can affect the capacity available to us. If a component from a sole-source supplier is delayed or becomes unavailable, whether because of supplier capacity constraint, industry shortages, legal or regulatory changes that restrict supply sources, or other reasons, we may not obtain timely replacement supplies, resulting in reduced sales or inadequate datacenter capacity. Component shortages, excess or obsolete inventory, or price reductions resulting in inventory adjustments may increase our cost of revenue. Xbox consoles, Surface devices, datacenter servers, and other hardware are assembled in Asia and other geographies that may be subject to disruptions in the supply chain, resulting in shortages that would affect our revenue and operating margins. These same risks would apply to any other hardware and software products we may offer. \nLEGAL, REGULATORY, AND LITIGATION RISKS\nGovernment litigation and regulatory activity relating to competition rules may limit how we design and market our products.As a leading global software and device maker, government agencies closely scrutinize us under U.S. and foreign competition laws. Governments are actively enforcing competition laws and regulations, and this includes scrutiny in potentially large markets such as the European Union (EU), the U.S., and China. Some jurisdictions also allow competitors or consumers to assert claims of anti-competitive conduct. U.S. federal and state antitrust authorities have previously brought enforcement actions and continue to scrutinize our business. \nThe European Commission (the Commission) closely scrutinizes the design of high-volume Microsoft products and the terms on which we make certain technologies used in these products, such as file formats, programming interfaces, and protocols, available to other companies. Flagship product releases such as Windows can receive significant scrutiny under competition laws. For example, in 2004, the Commission ordered us to create new versions of our Windows operating system that do not include certain multimedia technologies and to provide our competitors with specifications for how to implement certain proprietary Windows communications protocols in their own products. In 2009, the Commission accepted a set of commitments we offered to address the Commissions concerns relating to competition in web browsing software, including an undertaking to address Commission concerns relating to interoperability. The web browsing commitments expired in 2014. The remaining obligations may limit our ability to innovate in Windows or other products in the future, diminish the developer appeal of the Windows platform, and increase our product development costs. The availability of licenses related to protocols and file formats may enable competitors to develop software products that better mimic the functionality of our products, which could hamper sales of ourproducts. \nOur portfolio of first-party devices continues to grow at the same time our OEM partners offer a large variety of devices for our platforms. As a result, increasingly we both cooperate and compete with our OEM partners, creating a risk that we fail to do so in compliance with competition rules. Regulatory scrutiny in this area may increase. Certain foreign governments, particularly in China and other countries in Asia, have advanced arguments under their competition laws that exert downward pressure on royalties for our intellectual property. \nGovernment regulatory actions and court decisions such as these may result in fines or hinder our ability to provide the benefits of our software to consumers and businesses, reducing the attractiveness of our products and the revenue that come from them. New competition law actions could be initiated, potentially using previous actions as precedent. The outcome of such actions, or steps taken to avoid them, could adversely affect us in a variety of ways, including: \n<div>\n<table>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\nWe may have to choose between withdrawing products from certain geographies to avoid fines or designing and developing alternative versions of those products to comply with government rulings, which may entail a delay in a product release and removing functionality that customers want or on which developers rely. </td></tr></table></div>\n29\n\nPART I\n°Item",
            "°Item 1A\n\nLaws and regulations relating to the handling of personal data may impede the adoption of our services or result in increased costs, legal claims, fines against us, or reputational damage.The growth of our Internet- and cloud-based services internationally relies increasingly on the movement of data across national boundaries. Legal requirements relating to the collection, storage, handling, and transfer of personal data continue to evolve. For example, in July 2020 the Court of Justice of the EU invalidated a framework called Privacy Shield for companies to transfer data from EU member states to the United States. This ruling has led to uncertainty about the legal requirements for data transfers from the EU under other legal mechanisms. Potential new rules and restrictions on the flow of data across borders could increase the cost and complexity of delivering our products and services in some markets. In May 2018, the EU General Data Protection Regulation (GDPR), became effective.The law, which applies to all of our activities conducted from an establishment in the EU or related to products and services offered in the EU, imposes a range of compliance obligations regarding the handling of personal data. Engineering efforts to build and maintain capabilities to facilitate compliance with the law have entailed substantial expense and the diversion of engineering resources from other projects and may continue to do so. We might experience reduced demand for our offerings if we are unable to engineer products that meet our legal duties or help our customers meet their obligations under the GDPR or other data regulations, or if our implementation to comply with the GDPR makes our offerings less attractive. The GDPR imposes significant new obligations and compliance with these obligations depends in part on how particular regulators interpret and apply them. If we fail to comply with the GDPR, or if regulators assert we have failed to comply with the GDPR, it may lead to regulatory enforcement actions, which can result in monetary penalties of up to 4% of worldwide revenue, private lawsuits, reputational damage, and loss of customers. Countries around the world, and states in the U.S. such as California, Colorado, and Virginia, have adopted, or are considering adopting or expanding, laws and regulations imposing obligations regarding the handling of personal data.\nThe Companys investment in gaining insights from data is becoming central to the value of the services we deliver to customers, to our operational efficiency and key opportunities in monetization, customer perceptions of quality, and operational efficiency. Our ability to use data in this way may be constrained by regulatory developments that impede realizing the expected return from this investment. Ongoing legal analyses, reviews, and inquiries by regulators of Microsoft practices, or relevant practices of other organizations, may result in burdensome or inconsistent requirements, including data sovereignty and localization requirements, affecting the location, movement, collection, and use of our customer and internal employee data as well as the management of that data. Compliance with applicable laws and regulations regarding personal data may require changes in services, business practices, or internal systems that result in increased costs, lower revenue, reduced efficiency, or greater difficulty in competing with foreign-based firms. Compliance with data regulations might limit our ability to innovate or offer certain features and functionality in some jurisdictions where we operate. Failure to comply with existing or new rules may result in significant penalties or orders to stop the alleged noncompliant activity, as well as negative publicity and diversion of management time and effort. \nWe have claims and lawsuits against us that may result in adverse outcomes.We are subject to a variety of claims and lawsuits. These claims may arise from a wide variety of business practices and initiatives, including major new product releases such as Windows, significant business transactions, warranty or product claims, and employment practices. Adverse outcomes in some or all of these claims may result in significant monetary damages or injunctive relief that could adversely affect our ability to conduct our business. The litigation and other claims are subject to inherent uncertainties and managements view of these matters may change in the future. A material adverse impact in our consolidated financial statements could occur for the period in which the effect of an unfavorable outcome becomes probable and reasonably estimable. \nOur business with government customers may present additional uncertainties. We derive substantial revenue from government contracts. Government contracts generally can present risks and challenges not present in private commercial agreements. For instance, we may be subject to government audits and investigations relating to these contracts, we could be suspended or debarred as a governmental contractor, we could incur civil and criminal fines and penalties, and under certain circumstances contracts may be rescinded. Some agreements may allow a government to terminate without cause and provide for higher liability limits for certain losses.Some contracts may be subject to periodic funding approval, reductions, or delays which could adversely impact public-sector demand for our products and services. These events could negatively impact our results of operations, financial condition, and reputation. \n31\n\nPART I\n°Item",
            "°Item 1A\n\nThird parties may claim we infringe their intellectual property rights.From time to time, others claim we infringe their intellectual property rights. The number of these claims may grow because of constant technological change in the markets in which we compete, the extensive patent coverage of existing technologies, the rapid rate of issuance of new patents, and our offering of first-party devices, such as Surface. To resolve these claims, we may enter into royalty and licensing agreements on terms that are less favorable than currently available, stop selling or redesign affected products or services, or pay damages to satisfy indemnification commitments with our customers. These outcomes may cause operating margins to decline. Besides money damages, in some jurisdictions plaintiffs can seek injunctive relief that may limit or prevent importing, marketing, and selling our products or services that have infringing technologies. In some countries, such as Germany, an injunction can be issued before the parties have fully litigated the validity of the underlying patents. We have paid significant amounts to settle claims related to the use of technology and intellectual property rights and to procure intellectual property rights as part of our strategy to manage this risk, and may continue to do so. \nGENERAL RISKS\nIf our reputation or our brands are damaged, our business and operating results may be harmed. Our reputation and brands are globally recognized and are important to our business. Our reputation and brands affect our ability to attract and retain consumer, business, and public-sector customers. There are numerous ways our reputation or brands could be damaged. These include product safety or quality issues, or our environmental impact and sustainability, supply chain practices, or human rights record. We may experience backlash from customers, government entities, advocacy groups, employees, and other stakeholders that disagree with our product offering decisions or public policy positions. Damage to our reputation or our brands may occur from, among other things: \n<div>\n<table>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\nThe introduction of new features, products, services, or terms of service that customers, users, or partners do not like.</td></tr></table></div>\n<div>\n<table>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\nPublic scrutiny of our decisions regarding user privacy, data practices, or content. </td></tr></table></div>\n<div>\n<table>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\nData security breaches, compliance failures, or actions of partners or individual employees. </td></tr></table></div>\nThe proliferation of social media may increase the likelihood, speed, and magnitude of negative brand events. If our brands or reputation are damaged, it could negatively impact our revenues or margins, or ability to attract the most highly qualified employees.\nAdverse economic or market conditions may harm our business.Worsening economic conditions, including inflation, recession, pandemic, or other changes in economic conditions, may cause lower IT spending and adversely affect our revenue. If demand for PCs, servers, and other computing devices declines, or consumer or business spending for those products declines, our revenue will be adversely affected. \nOur product distribution system relies on an extensive partner and retail network. OEMs building devices that run our software have also been a significant means of distribution. The impact of economic conditions on our partners, such as the bankruptcy of a major distributor, OEM, or retailer, could cause sales channel disruption. \nChallenging economic conditions also may impair the ability of our customers to pay for products and services they have purchased. As a result, allowances for doubtful accounts and write-offs of accounts receivable may increase. \nWe maintain an investment portfolio of various holdings, types, and maturities. These investments are subject to general credit, liquidity, market, and interest rate risks, which may be exacerbated by market downturns or events that affect global financial markets. A significant part of our investment portfolio comprises U.S. government securities. If global financial markets decline for long periods, or if there is a downgrade of the U.S. government credit rating due to an actual or threatened default on government debt, our investment portfolio may be adversely affected and we could determine that more of our investments have experienced a decline in fair value, requiring impairment charges that could adversely affect our consolidated financial statements.\n33\n\nPART I\n°Item",
            "°Item 1A\n\nThe long-term effects of climate change on the global economy and the IT industry in particular are unclear. Environmental regulations or changes in the supply, demand or available sources of energy or other resources may affect the availability or cost of goods and services, including natural resources, necessary to run our business. Changes in climate where we operate may increase the costs of powering and cooling computer hardware we use to develop software and provide cloud-based services.\nOur global business exposes us to operational and economic risks.Our customers are located throughout the world and a significant part of our revenue comes from international sales. The global nature of our business creates operational, economic, and geopolitical risks. Our results of operations may be affected by global, regional, and local economic developments, monetary policy, inflation, and recession, as well as political and military disputes. In addition, our international growth strategy includes certain markets, the developing nature of which presents several risks, including deterioration of social, political, labor, or economic conditions in a country or region, and difficulties in staffing and managing foreign operations. Emerging nationalist and protectionist trends and concerns about human rights and political expression in specific countries may significantly alter the trade and commercial environments. Changes to trade policy or agreements as a result of populism, protectionism, or economic nationalism may result in higher tariffs, local sourcing initiatives, and non-local sourcing restrictions, export controls, investment restrictions, or other developments that make it more difficult to sell our products in foreign countries. Disruptions of these kinds in developed or emerging markets could negatively impact demand for our products and services or increase operating costs. Although we hedge a portion of our international currency exposure, significant fluctuations in foreign exchange rates between the U.S. dollar and foreign currencies may adversely affect our results of operations. \nOur business depends on our ability to attract and retain talented employees.Our business is based on successfully attracting and retaining talented employees representing diverse backgrounds, experiences, and skill sets. The market for highly skilled workers and leaders in our industry is extremely competitive. Maintaining our brand and reputation, as well as a diverse and inclusive work environment that enables all our employees to thrive, are important to our ability to recruit and retain employees. We are also limited in our ability to recruit internationally by restrictive domestic immigration laws. Changes to U.S. immigration policies that restrain the flow of technical and professional talent may inhibit our ability to adequately staff our research and development efforts. If we are less successful in our recruiting efforts, or if we cannot retain highly skilled workers and key leaders, our ability to develop and deliver successful products and services may be adversely affected. Effective succession planning is also important to our long-term success. Failure to ensure effective transfer of knowledge and smooth transitions involving key employees could hinder our strategic planning and execution. How employment-related laws are interpreted and applied to our workforce practices may result in increased operating costs and less flexibility in how we meet our workforce needs. \n\n\n\n35\n\nPART I\n°Item"
        ]
    },
    "Item 1B": {
        "text": [
            "°Item1B.</td>\n<td>\n</td>\n<td>\nUnresolved Staff Comments</td>\n<td>\n</td>\n<td>\n36</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n°Item",
            "°Item 1B, 2, 3, 4\n\n°Item"
        ]
    },
    "Item 2": {
        "text": [
            "°Item2.</td>\n<td>\n</td>\n<td>\nProperties</td>\n<td>\n</td>\n<td>\n36</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n°Item",
            "°Item2. PROPERTIES \nOur corporate headquarters are located in Redmond, Washington. We have approximately 15million square feet of space located in King County, Washington that is used for engineering, sales, marketing, and operations, among other general and administrative purposes. These facilities include approximately 10million square feet of owned space situated on approximately 520 acres of land we own at our corporate headquarters, and approximately 5 million square feet of space we lease. In addition, we own and lease space domestically that includes office and datacenter space.\nWe also own and lease facilities internationally for datacenters, research and development, and other operations. The largest owned properties include space in the following locations: China, India, Ireland, the Netherlands, Singapore, and South Korea. The largest leased properties include space in the following locations: Australia, Canada, China, France, Germany, India, Israel, Japan, Netherlands, and the United Kingdom.\nIn addition to the above locations, we have various product development facilities, both domestically and internationally, as described under Research and Development (Part I, Item1 of this Form 10-K).\nThe table below shows a summary of the square footage of our office, datacenter, and other facilities owned and leased domestically and internationally as of June 30, 2021:\n\n<div>\n<table>\n<tr>\n<td>\n(Square feet in millions)</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nLocation </td>\n<td>\n</td>\n<td>\nOwned</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nLeased</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nTotal</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nU.S.</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n22</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n17</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n39</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nInternational</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n9</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n19</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n28</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nTotal </td>\n<td>\n</td>\n<td>\n</td>\n<td>\n31</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n36</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n67</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n</table></div>\n°Item"
        ]
    },
    "Item 3": {
        "text": [
            "°Item3.</td>\n<td>\n</td>\n<td>\nLegal Proceedings</td>\n<td>\n</td>\n<td>\n36</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n°Item",
            "°Item3.LEGAL PROCEEDINGS \nWhile not material to the Company, the Company was required to make annual reports of the general activities of the Companys Antitrust Compliance Office as required by the Final Order and Judgment in Barovic v. Ballmer et al, United States District Court for the Western District of Washington (Final Order). For more information see http://aka.ms/MSLegalNotice2015. The Final Order expired in April of 2021. During fiscal year 2021, the Antitrust Compliance Office (a) monitored the Companys compliance with the European Commission Decision of March 24, 2004, (2004 Decision) and with the Companys Public Undertaking to the European Commission dated December 16, 2009 (2009 Undertaking) (b) monitored, in the manner required by the Final Order, employee, customer, competitor, regulator, or other third-party complaints regarding compliance with the 2004 Decision, the 2009 Undertaking, or other EU or U.S. laws or regulations governing tying, bundling, and exclusive dealing contracts and, (c) monitored, in the manner required by the Final Order, the training of the Companys employees regarding the Companys antitrust compliance polices.In addition, prior to expiration of the Final Order, the Antitrust Compliance Officer reported to the Regulatory and Public Policy Committee of the Board at each of its regularly scheduled meetings.\nRefer to Note 15  Contingencies of the Notes to Financial Statements (Part II, Item8 of this Form 10-K) for information regarding legal proceedings in which we are involved. \n°Item"
        ]
    },
    "Item 4": {
        "text": [
            "°Item 4.</td>\n<td>\n</td>\n<td>\nMine Safety Disclosures</td>\n<td>\n</td>\n<td>\n36</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nPARTII</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n°Item",
            "°Item4.MINE SAFETY DISCLOSURES \nNot applicable.\n\n\n36\n\nPART II\n°Item"
        ]
    },
    "Item X": {
        "text": []
    },
    "Item 5": {
        "text": [
            "°Item5.</td>\n<td>\n</td>\n<td>\nMarket for Registrants Common Equity, Related Stockholder Matters, and Issuer Purchases of Equity Securities</td>\n<td>\n</td>\n<td>\n37</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n°Item",
            "°Item 5\n\nPART II\n°Item"
        ]
    },
    "Item 6": {
        "text": [
            "°Item6.</td>\n<td>\n</td>\n<td>\n[Reserved]</td>\n<td>\n</td>\n<td>\n38</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n°Item",
            "°Item 6\n\n°Item"
        ]
    },
    "Item 7": {
        "text": [
            "°Item7.</td>\n<td>\n</td>\n<td>\nManagements Discussion and Analysis of Financial Condition and Results of Operations</td>\n<td>\n</td>\n<td>\n39</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n°Item",
            "°Item 7\n\n°Item",
            "°Item 7\n\nIndustry Trends \nOur industry is dynamic and highly competitive, with frequent changes in both technologies and business models. Each industry shift is an opportunity to conceive new products, new technologies, or new ideas that can further transform the industry and our business. At Microsoft, we push the boundaries of what is possible through a broad range of research and development activities that seek to identify and address the changing demands of customers and users, industry trends, and competitive forces.\nEconomic Conditions, Challenges, and Risks\nThe markets for software, devices, and cloud-based services are dynamic and highly competitive. Our competitors are developing new software and devices, while also deploying competing cloud-based services for consumers and businesses. The devices and form factors customers prefer evolve rapidly, and influence how users access services in the cloud, and in some cases, the users choice of which suite of cloud-based services to use. We must continue to evolve and adapt over an extended time in pace with this changing environment. The investments we are making in infrastructure and devices will continue to increase our operating costs and may decrease our operating margins.\nOur success is highly dependent on our ability to attract and retain qualified employees. We hire a mix of university and industry talent worldwide. We compete for talented individuals globally by offering an exceptional working environment, broad customer reach, scale in resources, the ability to grow ones career across many different products and businesses, and competitive compensation and benefits. Aggregate demand for our software, services, and devices is correlated to global macroeconomic and geopolitical factors, which remain dynamic.\nOur devices are primarily manufactured by third-party contract manufacturers, some of which contain certain components for which there are very few qualified suppliers. For these components, we have limited near-term flexibility to use other manufacturers if a current vendor becomes unavailable or is unable to meet our requirements. Extended disruptions at these suppliers could lead to a similar disruption in our ability to manufacture devices on time to meet consumer demand.\nOur international operations provide a significant portion of our total revenue and expenses. Many of these revenue and expenses are denominated in currencies other than the U.S. dollar. As a result, changes in foreign exchange rates may significantly affect revenue and expenses. Weakening of the U.S. dollar relative to certain foreign currencies increased reported revenue and did not have a material impact on reported expenses from our international operations in fiscal year 2021.\nRefer to Risk Factors (Part I, Item1A of this Form 10-K) for a discussion of these factors and other risks.\nCOVID-19\nIn fiscal year 2021, the COVID-19 pandemic continued to impact our business operations and financial results. Cloud usage and demand benefited as customers accelerate their digital transformation priorities. Our consumer businesses also benefited from the remote environment, with continued demand for PCs and productivity tools, as well as strong engagement across our Gaming platform. We saw improvement in customer advertising spend and savings in operating expenses related to COVID-19, but experienced weakness in transactional licensing. The COVID-19 pandemic may continue to impact our business operations and financial operating results, and there is uncertainty in the nature and degree of its continued effects over time. Refer to Risk Factors (Part I, Item1A of this Form 10-K) for a discussion of these factors and other risks.\nSeasonality\nOur revenue fluctuates quarterly and is generally higher in the second and fourth quarters of our fiscal year. Second quarter revenue is driven by corporate year-end spending trends in our major markets and holiday season spending by consumers, and fourth quarter revenue is driven by the volume of multi-year on-premises contracts executed during the period.\n40\n\nPART II\n°Item",
            "°Item 7\n\nProductivity and Business Processes and Intelligent Cloud\nMetrics related to our Productivity and Business Processes and Intelligent Cloud segments assess the health of our core businesses within these segments. The metrics reflect our cloud and on-premises product strategies and trends.\n\n<div>\n<table>\n<tr>\n<td>\nOffice Commercial products and cloud services revenue growth</td>\n<td>\n</td>\n<td>\nRevenue from Office Commercial products and cloud services (Office 365 subscriptions, the Office 365 portion of Microsoft 365 Commercial subscriptions, and Office licensed on-premises), comprising Office, Exchange, SharePoint, Microsoft Teams, Office 365 Security and Compliance, and Skype for Business</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nOffice Consumer products and cloud services revenue growth</td>\n<td>\n</td>\n<td>\nRevenue from Office Consumer products and cloud services, including Microsoft 365 Consumer subscriptions and Office licensed on-premises</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nOffice 365 Commercial seat growth</td>\n<td>\n</td>\n<td>\nThe number of Office 365 Commercial seats at end of period where seats are paid users covered by an Office 365 Commercial subscription</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nMicrosoft 365 Consumer subscribers</td>\n<td>\n</td>\n<td>\nThe number of Microsoft 365 Consumer (formerly Office 365 Consumer) subscribers at end of period</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nDynamics products and cloud services revenue growth</td>\n<td>\n</td>\n<td>\nRevenue from Dynamics products and cloud services, including Dynamics 365, comprising a set of intelligent, cloud-based applications across ERP, CRM, Customer Insights, Power Apps, and Power Automate and on-premises ERP and CRM applications</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nLinkedIn revenue growth</td>\n<td>\n</td>\n<td>\nRevenue from LinkedIn, including Talent Solutions, Marketing Solutions, Premium Subscriptions, Sales Solutions, and Learning Solutions</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nServer products and cloud services revenue growth</td>\n<td>\n</td>\n<td>\nRevenue from Server products and cloud services, including Azure SQL Server, Windows Server, Visual Studio, System Center, and related Client Access Licenses (CALs) and GitHub</td>\n</tr>\n</table></div>\nMore Personal Computing\nMetrics related to our More Personal Computing segment assess the performance of key lines of business within this segment. These metrics provide strategic product insights which allow us to assess the performance across our commercial and consumer businesses. As we have diversity of target audiences and sales motions within the Windows business, we monitor metrics that are reflective of those varying motions.\n\n<div>\n<table>\n<tr>\n<td>\nWindows OEM Pro revenue growth</td>\n<td>\n</td>\n<td>\nRevenue from sales of Windows Pro licenses sold through the OEM channel, which primarily addresses demand in the commercial market</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nWindows OEM non-Pro revenue growth</td>\n<td>\n</td>\n<td>\nRevenue from sales of Windows non-Pro licenses sold through the OEM channel, which primarily addresses demand in the consumer market</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr></table></div>\n42\n\nPART II\n°Item",
            "°Item 7\n\nOperating income increased $17.0 billion or 32% driven by growth across each of our segments and the change in estimated useful lives of our server and network equipment.\nCurrent year net income and diluted EPS were positively impacted by the tax benefit related to the India Supreme Court decision on withholding taxes, which resulted in an increase to net income and diluted EPS of $620 million and $0.08, respectively.\nRevenue, gross margin, and operating income included a favorable foreign currency impact of 3%, 3%, and 4%, respectively. \nSEGMENT RESULTS OF OPERATIONS\n\n<div>\n<table>\n<tr>\n<td>\n(In millions, except percentages)</td>\n<td>\n</td>\n<td>\n2021</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n2020</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nPercentageChange </td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nRevenue</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nProductivity and Business Processes</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n53,915</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n46,398</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n16%</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nIntelligent Cloud</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n60,080</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n48,366</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n24%</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nMore Personal Computing</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n54,093</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n48,251</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n12%</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nTotal </td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n168,088</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n143,015</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n18%</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nOperating Income </td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nProductivity and Business Processes</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n24,351</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n18,724</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n30%</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nIntelligent Cloud</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n26,126</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n18,324</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n43%</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nMore Personal Computing</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n19,439</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n15,911</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n22%</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nTotal </td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n69,916</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n52,959</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n32%</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n</table></div>\nReportable Segments \nProductivity and Business Processes \nRevenue increased $7.5 billion or 16%. \n<div>\n<table>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\nOffice Commercial products and cloud services revenue increased $4.0 billion or 13%. Office 365 Commercial revenue grew 22% driven by seat growth of 17% and higher revenue per user. Office Commercial products revenue declined 23% driven by continued customer shift to cloud offerings and transactional weakness. </td></tr></table></div>\n<div>\n<table>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\nOffice Consumer products and cloud services revenue increased $474 million or 10% driven by Microsoft 365 Consumer subscription revenue, on a strong prior year comparable that benefited from transactional strength in Japan. Microsoft 365 Consumer subscribers increased 22% to 51.9 million.</td></tr></table></div>\n<div>\n<table>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\nLinkedIn revenue increased $2.2 billion or 27% driven by advertising demand in our Marketing Solutions business.</td></tr></table></div>\n<div>\n<table>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\nDynamics products and cloud services revenue increased 25% driven by Dynamics 365 growth of 43%. </td></tr></table></div>\nOperating income increased $5.6 billion or 30%.\n<div>\n<table>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\nGross margin increased $6.5 billion or 18% driven by growth in Office 365 Commercial and LinkedIn, and the change in estimated useful lives of our server and network equipment. Gross margin percentage increased with the change in estimated useful lives of our server and network equipment. Excluding this impact, gross margin percentage decreased slightly driven by a sales mix shift to cloud offerings, on a low prior year comparable impacted by increased usage.</td></tr></table></div>\n<div>\n<table>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\nOperating expenses increased $839 million or 5% driven by investments in commercial sales, cloud engineering, and LinkedIn.</td></tr></table></div>\nRevenue, gross margin, and operating income included a favorable foreign currency impact of 2%, 3%, and 4%, respectively. \n44\n\nPART II\n°Item",
            "°Item 7\n\nOPERATING EXPENSES\nResearch and Development\n\n<div>\n<table>\n<tr>\n<td>\n(In millions, except percentages)</td>\n<td>\n</td>\n<td>\n2021</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n2020</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nPercentageChange</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td></td>\n<td></td>\n<td></td>\n<td></td>\n<td></td>\n<td></td>\n<td></td>\n<td></td>\n<td></td>\n<td></td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nResearch and development</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n20,716</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n19,269</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n8%</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nAs a percent of revenue</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n12%</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n13%</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(1)ppt</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n</table></div>\n\nResearch and development expenses include payroll, employee benefits, stock-based compensation expense, and other headcount-related expenses associated with product development. Research and development expenses also include third-party development and programming costs, localization costs incurred to translate software for international markets, and the amortization of purchased software code and services content. \nResearch and development expenses increased $1.4 billion or 8% driven by investments in cloud engineering.\nSales and Marketing\n\n<div>\n<table>\n<tr>\n<td>\n(In millions, except percentages)</td>\n<td>\n</td>\n<td>\n2021</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n2020</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nPercentageChange</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nSales and marketing</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n20,117</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n19,598</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n\n3%</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nAs a percent of revenue</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n12%</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n14%</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(2)ppt</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n</table></div>\n\nSales and marketing expenses include payroll, employee benefits, stock-based compensation expense, and other headcount-related expenses associated with sales and marketing personnel, and the costs of advertising, promotions, trade shows, seminars, and other programs. \nSales and marketing expenses increased $519 million or 3% driven by investments in commercial sales, offset in part by a reduction in bad debt expense. Sales and marketing included an unfavorable foreign currency impact of 2%.\nGeneral and Administrative\n\n<div>\n<table>\n<tr>\n<td>\n(In millions, except percentages)</td>\n<td>\n</td>\n<td>\n2021</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n2020</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nPercentageChange </td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nGeneral and administrative</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n5,107</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n5,111</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0%</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nAs a percent of revenue</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n3%</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n4%</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(1)ppt</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n</table></div>\n\nGeneral and administrative expenses include payroll, employee benefits, stock-based compensation expense, severance expense, and other headcount-related expenses associated with finance, legal, facilities, certain human resources and other administrative personnel, certain taxes, and legal and other administrative fees.\nGeneral and administrative expenses were relatively unchanged, driven by prior year charges associated with the closing of our Microsoft Store physical locations, offset in part by an increase in certain employee-related expenses and business taxes.\n46\n\nPART II\n°Item",
            "°Item 7\n\nAs of June 30, 2021, the primary unresolved issues for the IRS audits relate to transfer pricing, which could have a material impact in our consolidated financial statements when the matters are resolved. We believe our allowances for income tax contingencies are adequate. We have not received a proposed assessment for the unresolved key transfer pricing issues and do not expect a final resolution of these issues in the next 12 months.Based on the information currently available, we do not anticipate a significant increase or decrease to our tax contingencies for these issues within the next 12 months.\nWe are subject to income tax in many jurisdictions outside the U.S. Our operations in certain jurisdictions remain subject to examination for tax years 1996 to 2020, some of which are currently under audit by local tax authorities. The resolution of each of these audits is not expected to be material to our consolidated financial statements.\nNON-GAAP FINANCIAL MEASURES\nAdjusted net income and adjusted diluted EPS are non-GAAP financial measures which exclude the tax benefits related to the India Supreme Court decision on withholding taxes in fiscal year 2021. We believe these non-GAAP measures aid investors by providing additional insight into our operational performance and help clarify trends affecting our business. For comparability of reporting, management considers non-GAAP measures in conjunction with GAAP financial results in evaluating business performance. These non-GAAP financial measures presented should not be considered a substitute for, or superior to, the measures of financial performance prepared in accordance with GAAP.\nThe following table reconciles our financial results reported in accordance with GAAP to non-GAAP financial results:\n\n<div>\n<table>\n<tr>\n<td>\n(In millions, except percentages and per share amounts)</td>\n<td>\n</td>\n<td>\n2021</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n2020</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nPercentageChange </td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nNet income</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n61,271</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n44,281</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n38%</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nNet income tax benefit related to India Supreme Court decision on withholding taxes</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(620</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n*</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nAdjusted net income (non-GAAP)</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n60,651</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n44,281</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n37%</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nDiluted earnings per share</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n8.05</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n5.76</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n40%</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nNet income tax benefit related to India Supreme Court decision on withholding taxes</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(0.08</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n*</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nAdjusted diluted earnings per share (non-GAAP)</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n7.97</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n5.76</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n38%</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n</table></div>\n\n<div>\n<table>\n<tr>\n<td>\n*</td>\n<td>\nNot meaningful.</td></tr></table></div>\n48\n\nPART II\n°Item",
            "°Item 7\n\nUnearned Revenue \nUnearned revenue comprises mainly unearned revenue related to volume licensing programs, which may include Software Assurance (SA) and cloud services. Unearned revenue is generally invoiced annually at the beginning of each contract period for multi-year agreements and recognized ratably over the coverage period. Unearned revenue also includes payments for other offerings for which we have been paid in advance and earn the revenue when we transfer control of the product or service. Refer to Note 1  Accounting Policies of the Notes to Financial Statements (Part II, Item 8 of this Form 10-K) for further discussion.\nThe following table outlines the expected future recognition of unearned revenue as of June 30, 2021:\n\n<div>\n<table>\n<tr>\n<td>\n(In millions)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nThree Months Ending</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nSeptember 30, 2021</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n15,922</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nDecember 31, 2021</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n12,646</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nMarch 31, 2022</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n8,786</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nJune 30, 2022</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n4,171</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nThereafter</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n2,616</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nTotal</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n44,141</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n</table></div>\nIf our customers choose to license cloud-based versions of our products and services rather than licensing transaction-based products and services, the associated revenue will shift from being recognized at the time of the transaction to being recognized over the subscription period or upon consumption, as applicable. \nShare Repurchases \nDuring fiscal years 2021 and 2020, we repurchased 101 million shares and 126 million shares of our common stock for $23.0 billion and $19.7 billion, respectively, through our share repurchase programs. All repurchases were made using cash resources. Refer to Note 16  Stockholders Equity of the Notes to Financial Statements (Part II, Item8 of this Form 10-K) for further discussion.\nDividends \nRefer to Note 16  Stockholders Equity of the Notes to Financial Statements (Part II, Item8 of this Form 10-K) for further discussion.\nOff-Balance Sheet Arrangements \nWe provide indemnifications of varying scope and size to certain customers against claims of intellectual property infringement made by third parties arising from the use of our products and certain other matters. Additionally, we have agreed to cover damages resulting from breaches of certain security and privacy commitments in our cloud business. In evaluating estimated losses on these obligations, we consider factors such as the degree of probability of an unfavorable outcome and our ability to make a reasonable estimate of the amount of loss. These obligations did not have a material impact in our consolidated financial statements during the periods presented. \n50\n\nPART II\n°Item",
            "°Item 7\n\nRECENT ACCOUNTING GUIDANCE \nRefer to Note 1  Accounting Policies of the Notes to Financial Statements (Part II, Item8 of this Form 10-K) for further discussion.\nAPPLICATION OF CRITICAL ACCOUNTING POLICIES \nOur consolidated financial statements and accompanying notes are prepared in accordance with GAAP. Preparing consolidated financial statements requires management to make estimates and assumptions that affect the reported amounts of assets, liabilities, revenue, and expenses. These estimates and assumptions are affected by managements application of accounting policies, as well as uncertainty in the current economic environment due to COVID-19. Critical accounting policies for us include revenue recognition, impairment of investment securities, goodwill, research and development costs, contingencies, income taxes, and inventories. \nRevenue Recognition \nOur contracts with customers often include promises to transfer multiple products and services to a customer. Determining whether products and services are considered distinct performance obligations that should be accounted for separately versus together may require significant judgment. When a cloud-based service includes both on-premises software licenses and cloud services, judgment is required to determine whether the software license is considered distinct and accounted for separately, or not distinct and accounted for together with the cloud service and recognized over time. Certain cloud services, primarily Office 365, depend on a significant level of integration, interdependency, and interrelation between the desktop applications and cloud services, and are accounted for together as one performance obligation. Revenue from Office 365 is recognized ratably over the period in which the cloud services are provided. \nJudgment is required to determine the stand-alone selling price (SSP\") for each distinct performance obligation. We use a single amount to estimate SSP for items that are not sold separately, including on-premises licenses sold with SA or software updates provided at no additional charge. We use a range of amounts to estimate SSP when we sell each of the products and services separately and need to determine whether there is a discount to be allocated based on the relative SSP of the various products and services. \nIn instances where SSP is not directly observable, such as when we do not sell the product or service separately, we determine the SSP using information that may include market conditions and other observable inputs. We typically have more than one SSP for individual products and services due to the stratification of those products and services by customers and circumstances. In these instances, we may use information such as the size of the customer and geographic region in determining the SSP. \nDue to the various benefits from and the nature of our SA program, judgment is required to assess the pattern of delivery, including the exercise pattern of certain benefits across our portfolio of customers. \nOur products are generally sold with a right of return, we may provide other credits or incentives, and in certain instances we estimate customer usage of our products and services, which are accounted for as variable consideration when determining the amount of revenue to recognize. Returns and credits are estimated at contract inception and updated at the end of each reporting period if additional information becomes available. Changes to our estimated variable consideration were not material for the periods presented. \nImpairment of Investment Securities \nWe review debt investments quarterly for credit losses and impairment. If the cost of an investment exceeds its fair value, we evaluate, among other factors, general market conditions, credit quality of debt instrument issuers, and the extent to which the fair value is less than cost. This determination requires significant judgment. In making this judgment, we employ a systematic methodology that considers available quantitative and qualitative evidence in evaluating potential impairment of our investments. In addition, we consider specific adverse conditions related to the financial health of, and business outlook for, the investee. If we have plans to sell the security or it is more likely than not that we will be required to sell the security before recovery, then a decline in fair value below cost is recorded as an impairment charge in other income (expense), net and a new cost basis in the investment is established. If market, industry, and/or investee conditions deteriorate, we may incur future impairments. \n52\n\nPART II\n°Item",
            "°Item 7\n\nThe TCJA significantly changes existing U.S. tax law and includes numerous provisions that affect our business. Refer to Note 12  Income Taxes of the Notes to Financial Statements (Part II, Item 8 of this Form 10-K) for further discussion.\nInventories \nInventories are stated at average cost, subject to the lower of cost or net realizable value. Cost includes materials, labor, and manufacturing overhead related to the purchase and production of inventories. Net realizable value is the estimated selling price less estimated costs of completion, disposal, and transportation. We regularly review inventory quantities on hand, future purchase commitments with our suppliers, and the estimated utility of our inventory. These reviews include analysis of demand forecasts, product life cycle status, product development plans, current sales levels, pricing strategy, and component cost trends. If our review indicates a reduction in utility below carrying value, we reduce our inventory to a new cost basis through a charge to cost of revenue.\n\n54\n\nPART II\n°Item"
        ]
    },
    "Item 7A": {
        "text": [
            "°Item7A.</td>\n<td>\n</td>\n<td>\nQuantitative and Qualitative Disclosures about Market Risk</td>\n<td>\n</td>\n<td>\n56</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n°Item",
            "°Item 7A\n\n°Item"
        ]
    },
    "Item 8": {
        "text": [
            "°Item8.</td>\n<td>\n</td>\n<td>\nFinancial Statements and Supplementary Data</td>\n<td>\n</td>\n<td>\n57</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n°Item",
            "°Item 8\n\n°Item",
            "°Item 8\n\nCOMPREHENSIVE INCOME STATEMENTS \n\n<div>\n<table>\n<tr>\n<td>\n(In millions)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nYear Ended June30,</td>\n<td>\n</td>\n<td>\n2021</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n2020</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n2019</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nNet income</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n61,271</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n44,281</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n39,240</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nOther comprehensive income (loss), net of tax:</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nNet change related to derivatives</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n19</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(38</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(173</td>\n<td>\n)</td>\n</tr>\n<tr>\n<td>\nNet change related to investments</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(2,266</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n3,990</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n2,405 </td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nTranslation adjustments and other</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n873</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(426</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(318 </td>\n<td>\n)</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nOther comprehensive income (loss)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(1,374</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n3,526</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n1,914 </td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nComprehensive income</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n59,897</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n47,807</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n41,154</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n</table></div>\n\nRefer to accompanying notes. \n\n\n\n58\n\nPART II\n°Item",
            "°Item 8\n\nCASH FLOWS STATEMENTS \n\n<div>\n<table>\n<tr>\n<td>\n(In millions)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nYear Ended June30,</td>\n<td>\n</td>\n<td>\n2021</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n2020</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n2019</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nOperations</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nNet income</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n61,271</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n44,281</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n39,240</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nAdjustments to reconcile net income to net cash from operations:</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nDepreciation, amortization, and other</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n11,686</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n12,796</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n11,682</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nStock-based compensation expense</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n6,118</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n5,289</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n4,652</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nNet recognized gains on investments and derivatives</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(1,249</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(219 </td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(792</td>\n<td>\n)</td>\n</tr>\n<tr>\n<td>\nDeferred income taxes</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(150</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n11</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(6,463</td>\n<td>\n)</td>\n</tr>\n<tr>\n<td>\nChanges in operating assets and liabilities:</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nAccounts receivable</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(6,481</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(2,577 </td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(2,812</td>\n<td>\n)</td>\n</tr>\n<tr>\n<td>\nInventories</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(737</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n168</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n597</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nOther current assets</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(932</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(2,330</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(1,718</td>\n<td>\n)</td>\n</tr>\n<tr>\n<td>\nOther long-term assets</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(3,459</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(1,037</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(1,834</td>\n<td>\n)</td>\n</tr>\n<tr>\n<td>\nAccounts payable</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n2,798</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n3,018</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n232</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nUnearned revenue</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n4,633</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n2,212</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n4,462</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nIncome taxes</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(2,309</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(3,631</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n2,929</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nOther current liabilities</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n4,149</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n1,346</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n1,419</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nOther long-term liabilities</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n1,402</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n1,348</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n591</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nNet cash from operations</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n76,740</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n60,675</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n52,185</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nFinancing</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nCash premium on debt exchange</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(1,754</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(3,417</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nRepayments of debt</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(3,750</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(5,518</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(4,000</td>\n<td>\n)</td>\n</tr>\n<tr>\n<td>\nCommon stock issued</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n1,693</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n1,343</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n1,142</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nCommon stock repurchased</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(27,385</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(22,968</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(19,543</td>\n<td>\n)</td>\n</tr>\n<tr>\n<td>\nCommon stock cash dividends paid</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(16,521</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(15,137</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(13,811</td>\n<td>\n)</td>\n</tr>\n<tr>\n<td>\nOther, net</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(769</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(334</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(675</td>\n<td>\n)</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nNet cash used in financing</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(48,486</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(46,031</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(36,887</td>\n<td>\n)</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nInvesting</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nAdditions to property and equipment</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(20,622</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(15,441</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(13,925</td>\n<td>\n)</td>\n</tr>\n<tr>\n<td>\nAcquisition of companies, net of cash acquired, and purchases of intangible and other assets</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(8,909</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(2,521</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(2,388</td>\n<td>\n)</td>\n</tr>\n<tr>\n<td>\nPurchases of investments</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(62,924</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(77,190</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(57,697</td>\n<td>\n)</td>\n</tr>\n<tr>\n<td>\nMaturities of investments</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n51,792</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n66,449</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n20,043</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nSales of investments</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n14,008</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n17,721</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n38,194</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nOther, net</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(922</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(1,241</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nNet cash used in investing</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(27,577</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(12,223</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(15,773</td>\n<td>\n)</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nEffect of foreign exchange rates on cash and cash equivalents</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(29</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(201</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(115</td>\n<td>\n)</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nNet change in cash and cash equivalents</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n648</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n2,220</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(590</td>\n<td>\n)</td>\n</tr>\n<tr>\n<td>\nCash and cash equivalents, beginning of period</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n13,576</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n11,356</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n11,946</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nCash and cash equivalents, end of period</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n14,224</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n13,576</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n11,356</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n</table></div>\n\nRefer to accompanying notes. \n60\n\nPART II\n°Item",
            "°Item 8\n\nNOTES TO FINANCIAL STATEMENTS \nNOTE 1  ACCOUNTING POLICIES\nAccounting Principles \nOur consolidated financial statements and accompanying notes are prepared in accordance with accounting principles generally accepted in the United States of America (GAAP).\nWe have recast certain prior period amounts to conform to the current period presentation. The recast of these prior period amounts had no impact on our consolidated balance sheets, consolidated income statements, or consolidated cash flows statements. \nPrinciples of Consolidation \nThe consolidated financial statements include the accounts of Microsoft Corporation and its subsidiaries. Intercompany transactions and balances have been eliminated. \nEstimates and Assumptions \nPreparing financial statements requires management to make estimates and assumptions that affect the reported amounts of assets, liabilities, revenue, and expenses. Examples of estimates and assumptions include: for revenue recognition, determining the nature and timing of satisfaction of performance obligations, and determining the standalone selling price (SSP) of performance obligations, variable consideration, and other obligations such as product returns and refunds loss contingencies product warranties the fair value of and/or potential impairment of goodwill and intangible assets for our reporting units product life cycles useful lives of our tangible and intangible assets allowances for doubtful accounts the market value of, and demand for, our inventory stock-based compensation forfeiture rates when technological feasibility is achieved for our products the potential outcome of uncertain tax positions that have been recognized in our consolidated financial statements or tax returns and determining the timing and amount of impairments for investments. Actual results and outcomes may differ from managements estimates and assumptions due to risks and uncertainties, including uncertainty in the current economic environment due to COVID-19.\nIn July 2020, we completed an assessment of the useful lives of our server and network equipment and determined we should increase the estimated useful life of server equipment from three years to four years and increase the estimated useful life of network equipment from two years to four years. This change in accounting estimate was effective beginning fiscal year 2021. Based on the carrying amount of server and network equipment included in property and equipment, net as of June 30, 2020, the effect of this change in estimate for fiscal year 2021 was an increase in operating income of $2.7 billion and net income of $2.3 billion, or $0.30 per both basic and diluted share. \nForeign Currencies \nAssets and liabilities recorded in foreign currencies are translated at the exchange rate on the balance sheet date. Revenue and expenses are translated at average rates of exchange prevailing during the year. Translation adjustments resulting from this process are recorded to other comprehensive income. \nRevenue\nProduct Revenue and Service and Other Revenue \nProduct revenue includes sales from operating systems, cross-device productivity applications, server applications, business solution applications, desktop and server management tools, software development tools, video games, and hardware such as PCs, tablets, gaming and entertainment consoles, other intelligent devices, and related accessories. \nService and other revenue includes sales from cloud-based solutions that provide customers with software, services, platforms, and content such as Office 365, Azure, Dynamics 365, and Xbox solution support and consulting services. Service and other revenue also includes sales from online advertising and LinkedIn.\n62\n\nPART II\n°Item",
            "°Item 8\n\nJudgment is required to determine the SSP for each distinct performance obligation. We use a single amount to estimate SSP for items that are not sold separately, including on-premises licenses sold with SA or software updates provided at no additional charge. We use a range of amounts to estimate SSP when we sell each of the products and services separately and need to determine whether there is a discount to be allocated based on the relative SSP of the various products and services. \nIn instances where SSP is not directly observable, such as when we do not sell the product or service separately, we determine the SSP using information that may include market conditions and other observable inputs. We typically have more than one SSP for individual products and services due to the stratification of those products and services by customers and circumstances. In these instances, we may use information such as the size of the customer and geographic region in determining the SSP. \nDue to the various benefits from and the nature of our SA program, judgment is required to assess the pattern of delivery, including the exercise pattern of certain benefits across our portfolio of customers. \nOur products are generally sold with a right of return, we may provide other credits or incentives, and in certain instances we estimate customer usage of our products and services, which are accounted for as variable consideration when determining the amount of revenue to recognize. Returns and credits are estimated at contract inception and updated at the end of each reporting period if additional information becomes available. Changes to our estimated variable consideration were not material for the periods presented.\nContract Balances and Other Receivables \nTiming of revenue recognition may differ from the timing of invoicing to customers. We record a receivable when revenue is recognized prior to invoicing, or unearned revenue when revenue is recognized subsequent to invoicing. For multi-year agreements, we generally invoice customers annually at the beginning of each annual coverage period. We record a receivable related to revenue recognized for multi-year on-premises licenses as we have an unconditional right to invoice and receive payment in the future related to those licenses. \nUnearned revenue comprises mainly unearned revenue related to volume licensing programs, which may include SA and cloud services. Unearned revenue is generally invoiced annually at the beginning of each contract period for multi-year agreements and recognized ratably over the coverage period. Unearned revenue also includes payments for consulting services to be performed in the future, LinkedIn subscriptions, Office 365 subscriptions, Xbox subscriptions, Windows 10 post-delivery support, Dynamics business solutions, and other offerings for which we have been paid in advance and earn the revenue when we transfer control of the product or service. \nRefer to Note 13  Unearned Revenue for further information, including unearned revenue by segment and changes in unearned revenue during the period.\nPayment terms and conditions vary by contract type, although terms generally include a requirement of payment within 30 to 60 days. In instances where the timing of revenue recognition differs from the timing of invoicing, we have determined our contracts generally do not include a significant financing component. The primary purpose of our invoicing terms is to provide customers with simplified and predictable ways of purchasing our products and services, not to receive financing from our customers or to provide customers with financing. Examples include invoicing at the beginning of a subscription term with revenue recognized ratably over the contract period, and multi-year on-premises licenses that are invoiced annually with revenue recognized upfront.\nAs of June 30, 2021 and 2020, other receivables due from suppliers were $965 million and $442 million, respectively, and are included in accounts receivable, net in our consolidated balance sheets.\nAs of June 30, 2021 and 2020, long-term accounts receivable, net of allowance for doubtful accounts, was $3.4 billion and $2.7 billion, respectively, and is included in other long-term assets in our consolidated balance sheets.\nThe allowance for doubtful accounts reflects our best estimate of probable losses inherent in the accounts receivable balance. We determine the allowance based on known troubled accounts, historical experience, and other currently available evidence. \n64\n\nPART II\n°Item",
            "°Item 8\n\nResearch and Development \nResearch and development expenses include payroll, employee benefits, stock-based compensation expense, and other headcount-related expenses associated with product development. Research and development expenses also include third-party development and programming costs, localization costs incurred to translate software for international markets, and the amortization of purchased software code and services content. Such costs related to software development are included in research and development expense until the point that technological feasibility is reached, which for our software products, is generally shortly before the products are released to production. Once technological feasibility is reached, such costs are capitalized and amortized to cost of revenue over the estimated lives of the products. \nSales and Marketing \nSales and marketing expenses include payroll, employee benefits, stock-based compensation expense, and other headcount-related expenses associated with sales and marketing personnel, and the costs of advertising, promotions, trade shows, seminars, and other programs. Advertising costs are expensed as incurred. Advertising expense was $1.5 billion, $1.6 billion, and $1.6 billion in fiscal years 2021, 2020, and 2019, respectively. \nStock-Based Compensation \nCompensation cost for stock awards, which include restricted stock units (RSUs) and performance stock units (PSUs), is measured at the fair value on the grant date and recognized as expense, net of estimated forfeitures, over the related service or performance period. The fair value of stock awards is based on the quoted price of our common stock on the grant date less the present value of expected dividends not received during the vesting period. We measure the fair value of PSUs using a Monte Carlo valuation model. Compensation cost for RSUs is recognized using the straight-line method and for PSUs is recognized using the accelerated method.\nCompensation expense for the employee stock purchase plan (ESPP) is measured as the discount the employee is entitled to upon purchase and is recognized in the period of purchase.\nIncome Taxes \nIncome tax expense includes U.S. and international income taxes, and interest and penalties on uncertain tax positions. Certain income and expenses are not reported in tax returns and financial statements in the same year. The tax effect of such temporary differences is reported as deferred income taxes. Deferred tax assets are reported net of a valuation allowance when it is more likely than not that a tax benefit will not be realized. All deferred income taxes are classified as long-term in our consolidated balance sheets. \nFinancial Instruments\nInvestments\nWe consider all highly liquid interest-earning investments with a maturity of three months or less at the date of purchase to be cash equivalents. The fair values of these investments approximate their carrying values. In general, investments with original maturities of greater than three months and remaining maturities of less than one year are classified as short-term investments. Investments with maturities beyond one year may be classified as short-term based on their highly liquid nature and because such marketable securities represent the investment of cash that is available for current operations. \n66\n\nPART II\n°Item",
            "°Item 8\n\n<div>\n<table>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\nLevel 3  inputs are generally unobservable and typically reflect managements estimates of assumptions that market participants would use in pricing the asset or liability. The fair values are therefore determined using model-based techniques, including option pricing models and discounted cash flow models. Our Level 3 assets and liabilities include investments in corporate notes and bonds, municipal securities, and goodwill and intangible assets, when they are recorded at fair value due to an impairment charge.Unobservable inputs used in the models are significant to the fair values of the assets and liabilities. </td></tr></table></div>\nWe measure equity investments without readily determinable fair values on a nonrecurring basis. The fair values of these investments are determined based on valuation techniques using the best information available, and may include quoted market prices, market comparables, and discounted cash flow projections. \nOur other current financial assets and current financial liabilities have fair values that approximate their carrying values.\nInventories \nInventories are stated at average cost, subject to the lower of cost or net realizable value. Cost includes materials, labor, and manufacturing overhead related to the purchase and production of inventories. Net realizable value is the estimated selling price less estimated costs of completion, disposal, and transportation. We regularly review inventory quantities on hand, future purchase commitments with our suppliers, and the estimated utility of our inventory. If our review indicates a reduction in utility below carrying value, we reduce our inventory to a new cost basis through a charge to cost of revenue. \nProperty and Equipment \nProperty and equipment is stated at cost less accumulated depreciation, and depreciated using the straight-line method over the shorter of the estimated useful life of the asset or the lease term. The estimated useful lives of our property and equipment are generally as follows: computer software developed or acquired for internal use, three to seven years computer equipment, two to four years buildings and improvements, five to 15 years leasehold improvements, three to 20 years and furniture and equipment, one to 10 years. Land is not depreciated. \nLeases\nWe determine if an arrangement is a lease at inception. Operating leases are included in operating lease right-of-use (ROU) assets, other current liabilities, and operating lease liabilities in our consolidated balance sheets. Finance leases are included in property and equipment, other current liabilities, and other long-term liabilities in our consolidated balance sheets. \nROU assets represent our right to use an underlying asset for the lease term and lease liabilities represent our obligation to make lease payments arising from the lease. Operating lease ROU assets and liabilities are recognized at commencement date based on the present value of lease payments over the lease term. As most of our leases do not provide an implicit rate, we generally use our incremental borrowing rate based on the estimated rate of interest for collateralized borrowing over a similar term of the lease payments at commencement date. The operating lease ROU asset also includes any lease payments made and excludes lease incentives. Our lease terms may include options to extend or terminate the lease when it is reasonably certain that we will exercise that option. Lease expense for lease payments is recognized on a straight-line basis over the lease term. \nWe have lease agreements with lease and non-lease components, which are generally accounted for separately. For certain equipment leases, such as vehicles, we account for the lease and non-lease components as a single lease component. Additionally, for certain equipment leases, we apply a portfolio approach to effectively account for the operating lease ROU assets and liabilities. \nGoodwill \nGoodwill is tested for impairment at the reporting unit level (operating segment or one level below an operating segment) on an annual basis (May 1 for us) and between annual tests if an event occurs or circumstances change that would more likely than not reduce the fair value of a reporting unit below its carrying value. \n68\n\nPART II\n°Item",
            "°Item 8\n\nNOTE 3  OTHER INCOME (EXPENSE), NET \nThe components of other income (expense), net were as follows: \n\n<div>\n<table>\n<tr>\n<td>\n(In millions)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nYear Ended June30,</td>\n<td>\n</td>\n<td>\n2021</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n2020</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n2019</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nInterest and dividends income</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n2,131</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n2,680</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n2,762</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nInterest expense</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(2,346</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(2,591</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(2,686</td>\n<td>\n)</td>\n</tr>\n<tr>\n<td>\nNet recognized gains on investments</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n1,232</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n32</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n648</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nNet gains on derivatives</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n17</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n187</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n144</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nNet gains (losses) on foreign currency remeasurements</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n54</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(191</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(82</td>\n<td>\n)</td>\n</tr>\n<tr>\n<td>\nOther, net</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n98</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(40</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(57</td>\n<td>\n)</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nTotal</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n1,186</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n77</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n729</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n</table></div>\n\nNet Recognized Gains (Losses) on Investments \nNet recognized gains (losses) on debt investments were as follows: \n\n<div>\n<table>\n<tr>\n<td>\n(In millions)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nYear Ended June30,</td>\n<td>\n</td>\n<td>\n2021</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n2020</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n2019</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nRealized gains from sales of available-for-sale securities</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n105</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n50</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n12</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nRealized losses from sales of available-for-sale securities</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(40</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(37</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(93</td>\n<td>\n)</td>\n</tr>\n<tr>\n<td>\nImpairments and allowance for credit losses</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(2</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(17</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(16</td>\n<td>\n)</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nTotal</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n63</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n(4</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n(97</td>\n<td>\n)</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n</table></div>\n\nNet recognized gains (losses) on equity investments were as follows:\n\n<div>\n<table>\n<tr>\n<td>\n(In millions)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nYear Ended June30,</td>\n<td>\n</td>\n<td>\n2021</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n2020</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n2019</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nNet realized gains on investments sold</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n123</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n83</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n276</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nNet unrealized gains on investments still held</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n1,057</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n69</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n479</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nImpairments of investments</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(11</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(116</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(10</td>\n<td>\n)</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nTotal</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n1,169</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n36</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n745</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n</table></div>\n\n70\n\nPART II\n°Item",
            "°Item 8\n\n\n<div>\n<table>\n<tr>\n<td>\n(In millions)</td>\n<td>\n</td>\n<td>\nFairValue\nLevel</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nAdjusted\nCostBasis</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nUnrealized\nGains</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nUnrealized\nLosses</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nRecorded\nBasis</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nCash\nand Cash\nEquivalents</td>\n<td>\n</td>\n<td>\nShort-term\nInvestments</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nEquity\nInvestments</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nJune 30, 2020</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nChanges in Fair Value Recorded in Other Comprehensive Income</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nCommercial paper</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nLevel 2</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n4,687</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n1</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n0</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n4,688</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n1,618</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n3,070</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n0</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nCertificates of deposit</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nLevel 2</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n2,898</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n2,898</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n1,646</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n1,252</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nU.S. government securities</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nLevel 1</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n92,067</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n6,495</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(1</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n98,561</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n3,168</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n95,393</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nU.S. agency securities</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nLevel 2</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n2,439</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n2</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n2,441</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n449</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n1,992</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nForeign government bonds</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nLevel 2</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n6,982</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n6</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(3</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n6,985</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n1</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n6,984</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nMortgage- and asset-backed securities</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nLevel 2</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n4,865</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n41</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(6</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n4,900</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n4,900</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nCorporate notes and bonds</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nLevel 2</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n8,500</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n327</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(17</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n8,810</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n8,810</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nCorporate notes and bonds</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nLevel 3</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n58</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n58</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n58</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nMunicipal securities</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nLevel 2</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n313</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n57</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(4</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n366</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n366</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nMunicipal securities</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nLevel 3</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n91</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n91</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n91</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nTotal debt investments</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n122,900</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n6,929</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n(31</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n129,798</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n6,882</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n122,916</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n0</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nChanges in Fair Value Recorded in Net Income</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nEquity investments</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nLevel 1</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n1,198</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n784</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n0</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n414</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nEquity investments</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nOther</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n2,551</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n2,551</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nTotal equity investments</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n3,749</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n784</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n0</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n2,965</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nCash</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n5,910</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n5,910</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n0</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n0</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nDerivatives, net (a)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n35</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n35</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nTotal</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n139,492</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n13,576</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n122,951</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n2,965</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n</table></div>\n\n<div>\n<table>\n<tr>\n<td>\n(a)</td>\n<td>\nRefer to Note 5  Derivatives for further information on the fair value of our derivative instruments.</td></tr></table></div>\n\nEquity investments presented as Other in the tables above include investments without readily determinable fair values measured using the equity method or measured at cost with adjustments for observable changes in price or impairments, and investments measured at fair value using net asset value as a practical expedient which are not categorized in the fair value hierarchy. As of June 30, 2021 and 2020, equity investments without readily determinable fair values measured at cost with adjustments for observable changes in price or impairments were $3.3 billion and $1.4 billion, respectively. \nUnrealized Losses on Debt Investments \nDebt investments with continuous unrealized losses for less than 12 months and 12 months or greater and their related fair values were as follows: \n\n<div>\n<table>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\nLess than 12 Months</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n12 Months or Greater</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nTotalUnrealizedLosses</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n(In millions)</td>\n<td>\n</td>\n<td>\nFairValue</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nUnrealizedLosses</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nFairValue</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nUnrealizedLosses</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nTotalFairValue</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nJune 30, 2021</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nU.S. government and agency securities</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n5,294</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n(111</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n0</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n0</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n5,294</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n(111</td>\n<td>\n)</td>\n</tr>\n<tr>\n<td>\nForeign government bonds</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n3,148</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(1</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n5</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(1</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n3,153</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(2</td>\n<td>\n)</td>\n</tr>\n<tr>\n<td>\nMortgage- and asset-backed securities</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n1,211</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(5</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n87</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(1</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n1,298</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(6</td>\n<td>\n)</td>\n</tr>\n<tr>\n<td>\nCorporate notes and bonds</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n1,678</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(8</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n34</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(1</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n1,712</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(9</td>\n<td>\n)</td>\n</tr>\n<tr>\n<td>\nMunicipal securities</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n58</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(7</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n1</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n59</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(7</td>\n<td>\n)</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nTotal</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n11,389</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n(132</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n127</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n(3</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n11,516</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n(135</td>\n<td>\n)</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n</table></div>\n72\n\nPART II\n°Item",
            "°Item 8\n\nSecurities held in our fixed-income portfolio are subject to different interest rate risks based on their maturities. We manage the average maturity of our fixed-income portfolio to achieve economic returns that correlate to certain broad-based fixed-income indices using exchange-traded option and futures contracts and over-the-counter swap and option contracts. These contracts are not designated as hedging instruments and are included in Other contracts in the tables below.\nEquity \nSecurities held in our equity investments portfolio are subject to market price risk.At times, we may hold options, futures, and swap contracts. These contracts are not designated as hedging instruments and are included in Other contracts in the tables below.\nCredit \nOur fixed-income portfolio is diversified and consists primarily of investment-grade securities. We use credit default swap contracts to manage credit exposures relative to broad-based indices and to facilitate portfolio diversification. These contracts are not designated as hedging instruments and are included in Other contracts in the tables below.\nCredit-Risk-Related Contingent Features \nCertain of our counterparty agreements for derivative instruments contain provisions that require our issued and outstanding long-term unsecured debt to maintain an investment grade credit rating and require us to maintain minimum liquidity of $1.0 billion. To the extent we fail to meet these requirements, we will be required to post collateral, similar to the standard convention related to over-the-counter derivatives. As of June 30, 2021, our long-term unsecured debt rating was AAA, and cash investments were in excess of $1.0 billion. As a result, no collateral was required to be posted. \nThe following table presents the notional amounts of our outstanding derivative instruments measured in U.S. dollar equivalents:\n\n<div>\n<table>\n<tr>\n<td>\n(In millions)</td>\n<td>\n</td>\n<td>\nJune 30,\n2021</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nJune 30,\n2020</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nDesignated as Hedging Instruments</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nForeign exchange contracts purchased</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n635</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n635</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nForeign exchange contracts sold</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n6,081</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n6,754</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nInterest rate contracts purchased</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n1,247</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n1,295</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nNot Designated as Hedging Instruments</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nForeign exchange contracts purchased</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n14,223</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n11,896</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nForeign exchange contracts sold</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n23,391</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n15,595</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nOther contracts purchased</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n2,456</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n1,844</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nOther contracts sold</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n763</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n757</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n</table></div>\n\n74\n\nPART II\n°Item",
            "°Item 8\n\nGains (losses) on derivative instruments recognized in our consolidated income statements were as follows:\n\n<div>\n<table>\n<tr>\n<td>\n(In millions)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nYear Ended June30,</td>\n<td>\n</td>\n<td>\n2021</td>\n<td>\n</td>\n<td>\n2020</td>\n<td>\n2019</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\nRevenue</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nOtherIncome\n(Expense),Net</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nRevenue</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nOtherIncome\n(Expense),Net</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nRevenue</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nOther\nIncome\n(Expense),\nNet</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nDesignated as Fair Value Hedging Instruments</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nForeign exchange contracts</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nDerivatives</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n0</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n193</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n0</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n1</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n0</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n(130</td>\n<td>\n)</td>\n</tr>\n<tr>\n<td>\nHedged items</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(188</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n3</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n130</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nExcluded from effectiveness assessment</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n30</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n139</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n168</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nInterest rate contracts</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nDerivatives</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(37</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n93</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nHedged items</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n53</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(93</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nDesignated as Cash Flow Hedging Instruments</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nForeign exchange contracts</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nAmount reclassified from accumulated other comprehensive income</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n17</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n341</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nExcluded from effectiveness assessment</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(64</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nNot Designated as Hedging Instruments</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nForeign exchange contracts</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n27</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>(123</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(97</td>\n<td>\n)</td>\n</tr>\n<tr>\n<td>\nOther contracts</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n9</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n50</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n38</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n</table></div>\n\nGains (losses), net of tax, on derivative instruments recognized in our consolidated comprehensive income statements were as follows:\n\n<div>\n<table>\n<tr>\n<td>\n(In millions)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nYear Ended June30,</td>\n<td>\n</td>\n<td>\n2021</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n2020</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n2019</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nDesignated as Cash Flow Hedging Instruments</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nForeign exchange contracts</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nIncluded in effectiveness assessment</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n34</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n(38</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n159</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n</table></div>\n\nNOTE 6INVENTORIES\nThe components of inventories were as follows:\n\n<div>\n<table>\n<tr>\n<td>\n(In millions)</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nJune 30,</td>\n<td>\n</td>\n<td>\n2021</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n2020</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nRaw materials</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n1,190</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n700</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nWork in process</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n79</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n83</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nFinished goods</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n1,367</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n1,112</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nTotal</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n2,636</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n1,895</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n</table></div>\n\n76\n\nPART II\n°Item",
            "°Item 8\n\nFollowing are details of the purchase price allocated to the intangible assets acquired:\n\n<div>\n<table>\n<tr>\n<td>\n(In millions)</td>\n<td>\n</td>\n<td>\nAmount</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nWeighted\nAverage Life</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nTechnology-based</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n1,341</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n4 years</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nMarketing-related</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n627</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n11 years</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nTotal</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n1,968</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n6 years</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n</table></div>\n\nGitHub, Inc.\nOn October 25, 2018, we acquired GitHub, Inc. (GitHub), a software development platform, in a $7.5 billion stock transaction (inclusive of total cash payments of $1.3 billion in respect of vested GitHub equity awards and an indemnity escrow). The acquisition is expected to empower developers to achieve more at every stage of the development lifecycle, accelerate enterprise use of GitHub, and bring Microsofts developer tools and services to new audiences. The financial results of GitHub have been included in our consolidated financial statements since the date of the acquisition. GitHub is reported as part of our Intelligent Cloud segment.\nThe allocation of the purchase price to goodwill was completed as of June 30, 2019. The major classes of assets and liabilities to which we allocated the purchase price were as follows:\n\n<div>\n<table>\n<tr>\n<td>\n(In millions)</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nCash, cash equivalents, and short-term investments</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n234</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nGoodwill</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n5,497</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nIntangible assets</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n1,267</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nOther assets</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n143</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nOther liabilities</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(217</td>\n<td>\n)</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nTotal</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n6,924</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n</table></div>\n\nThe goodwill recognized in connection with the acquisition is primarily attributable to anticipated synergies from future growth and is not expected to be deductible for tax purposes. We assigned the goodwill to our Intelligent Cloud segment.\nFollowing are the details of the purchase price allocated to the intangible assets acquired: \n\n<div>\n<table>\n<tr>\n<td>\n(In millions)</td>\n<td>\n</td>\n<td>\nAmount</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nWeighted\nAverageLife</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nCustomer-related</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n648</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n8years</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nTechnology-based </td>\n<td>\n</td>\n<td>\n</td>\n<td>\n447</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n5years</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nMarketing-related</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n170</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n10years</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nContract-based</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n2</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n2years</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nTotal</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n1,267</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n7years</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n</table></div>\n\nTransactions recognized separately from the purchase price allocation were approximately $600 million, primarily related to equity awards recognized as expense over the related service period. \nNuance Communications, Inc.\nOn April 11, 2021, we entered into a definitive agreement to acquire Nuance Communications, Inc. (Nuance) for $56.00 per share in an all-cash transaction valued at $19.7 billion, inclusive of Nuances net debt. Nuance is a cloud and artificial intelligence (AI) software provider with healthcare and enterprise AI experience, and the acquisition will build on our industry-specific cloud offerings. The acquisition has been approved by Nuances shareholders, and we expect it to close by the end of calendar year 2021, subject to the satisfaction of certain regulatory approvals and other customary closing conditions.\n78\n\nPART II\n°Item",
            "°Item 8\n\nThe components of intangible assets acquired during the periods presented were as follows: \n\n<div>\n<table>\n<tr>\n<td>\n(In millions)</td>\n<td>\n</td>\n<td>\nAmount</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nWeighted\nAverageLife</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nAmount</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nWeighted\nAverageLife</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nYear Ended June30,</td>\n<td>\n</td>\n<td>\n2021</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n2020</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nTechnology-based</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n1,628</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n4years</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n531</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n6years</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nCustomer-related</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n96</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n4years</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n303</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n5years</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nMarketing-related</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n625</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n6 years</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n2</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n2 years</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nContract-based</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n10</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n3 years</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0 years</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nTotal</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n2,359</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n5years</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n836</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n5years</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n</table></div>\n\nIntangible assets amortization expense was $1.6 billion, $1.6 billion, and $1.9 billion for fiscal years 2021, 2020, and 2019, respectively. \nThe following table outlines the estimated future amortization expense related to intangible assets held as of June 30, 2021:\n\n<div>\n<table>\n<tr>\n<td>\n(In millions)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nYear Ending June30,</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n2022</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n1,683</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n2023</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n1,722</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n2024</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n1,415</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n2025</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n755</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n2026</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n498</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nThereafter</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n1,727</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nTotal</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n7,800</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n</table></div>\n\n80\n\nPART II\n°Item",
            "°Item 8\n\nNOTE 12INCOME TAXES \nTax Cuts and Jobs Act\nOn December 22, 2017, the Tax Cuts and Jobs Act (TCJA) was enacted into law, which significantly changed existing U.S. tax law and included numerous provisions that affect our business. We recorded a provisional net charge of $13.7 billion related to the enactment of the TCJA in fiscal year 2018 and adjusted the provisional net charge by recording additional tax expense of $157 million in fiscal year 2019 pursuant to Securities and Exchange Commission Staff Accounting Bulletin No. 118. \nIn fiscal year 2019, in response to the TCJA and recently issued regulations, we transferred certain intangible properties held by our foreign subsidiaries to the U.S. and Ireland. The transfers of intangible properties resulted in a $2.6 billion net income tax benefit recorded in the fourth quarter of fiscal year 2019, as the value of future tax deductions exceeded the current tax liability from foreign jurisdictions and U.S. global intangible low-taxed income (GILTI) tax. \nProvision for Income Taxes\nThe components of the provision for income taxes were as follows: \n\n<div>\n<table>\n<tr>\n<td>\n(In millions)</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nYear Ended June30,</td>\n<td>\n</td>\n<td>\n2021</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n2020</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n2019</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nCurrent Taxes</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nU.S. federal</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n3,285</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n3,537</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n4,718</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nU.S. state and local</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n1,229</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n763</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n662</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nForeign</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n5,467</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n4,444</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n5,531</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nCurrent taxes</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n9,981</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n8,744</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n10,911</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nDeferred Taxes</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nU.S. federal</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n25</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n58</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n(5,647</td>\n<td>\n)</td>\n</tr>\n<tr>\n<td>\nU.S. state and local</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(204</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(6</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(1,010</td>\n<td>\n)</td>\n</tr>\n<tr>\n<td>\nForeign</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n29</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(41</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n194</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nDeferred taxes</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n(150</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n11</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n(6,463</td>\n<td>\n)</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nProvision for income taxes</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n9,831</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n8,755</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n4,448</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n</table></div>\n\nU.S. and foreign components of income before income taxes were as follows: \n\n<div>\n<table>\n<tr>\n<td>\n(In millions)</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nYear Ended June30,</td>\n<td>\n</td>\n<td>\n2021</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n2020</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n2019</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nU.S.</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n34,972</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n24,116</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n15,799</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nForeign </td>\n<td>\n</td>\n<td>\n</td>\n<td>\n36,130</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n28,920</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n27,889</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nIncome before income taxes</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n71,102</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n53,036</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n43,688</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n</table></div>\n\n82\n\nPART II\n°Item",
            "°Item 8\n\nThe decrease in our effective tax rate for fiscal year 2021 compared to fiscal year 2020 was primarily due to tax benefits from the India Supreme Court decision on withholding taxes, an agreement between the U.S. and India tax authorities related to transfer pricing, final TCJA regulations, and an increase in tax benefits relating to stock-based compensation. The increase in our effective tax rate for fiscal year 2020 compared to fiscal year 2019 was primarily due to a $2.6 billion net income tax benefit in the fourth quarter of fiscal year 2019 related to intangible property transfers.\nThe components of the deferred income tax assets and liabilities were as follows: \n\n<div>\n<table>\n<tr>\n<td>\n(In millions)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nJune30,</td>\n<td>\n</td>\n<td>\n2021</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n2020</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td></td>\n</tr>\n<tr>\n<td>\nDeferred Income Tax Assets</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td></td>\n</tr>\n<tr>\n<td>\nStock-based compensation expense</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n502</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n461</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nAccruals, reserves, and other expenses</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n2,960</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n2,721</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nLoss and credit carryforwards</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n1,090</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n865</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nAmortization</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n6,346</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n6,737</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nLeasing liabilities</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n4,060</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n3,025</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nUnearned revenue</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n2,659</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n1,553</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nOther</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n543</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n354</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nDeferred income tax assets</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n18,160</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n15,716</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nLess valuation allowance</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(769</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(755</td>\n<td>\n)</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nDeferred income tax assets, net of valuation allowance</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n17,391</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n14,961</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nDeferred Income Tax Liabilities</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td></td>\n</tr>\n<tr>\n<td>\nBook/tax basis differences in investments and debt</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n(2,605</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n(2,642</td>\n<td>\n)</td>\n</tr>\n<tr>\n<td>\nLeasing assets</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(3,834</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(2,817</td>\n<td>\n)</td>\n</tr>\n<tr>\n<td>\nDepreciation</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(1,010</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(376</td>\n<td>\n)</td>\n</tr>\n<tr>\n<td>\nDeferred GILTI tax liabilities</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(2,815</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(2,581</td>\n<td>\n)</td>\n</tr>\n<tr>\n<td>\nOther</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(144</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(344</td>\n<td>\n)</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nDeferred income tax liabilities</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n(10,408</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n(8,760</td>\n<td>\n)</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nNet deferred income tax assets</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n6,983</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n6,201</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td></td>\n</tr>\n<tr>\n<td>\nReported As</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td></td>\n</tr>\n<tr>\n<td>\nOther long-term assets</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n7,181</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n6,405</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nLong-term deferred income tax liabilities</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(198</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(204</td>\n<td>\n)</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nNet deferred income tax assets</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n6,983</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n6,201</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n</table></div>\n\nDeferred income tax balances reflect the effects of temporary differences between the carrying amounts of assets and liabilities and their tax bases and are stated at enacted tax rates expected to be in effect when the taxes are paid or recovered. \nAs of June 30, 2021, we had federal, state, and foreign net operating loss carryforwards of $304 million, $1.3 billion, and $2.0 billion, respectively. The federal and state net operating loss carryforwards will expire in various years from fiscal 2022 through 2041, if not utilized. The majority of our foreign net operating loss carryforwards do not expire. Certain acquired net operating loss carryforwards are subject to an annual limitation but are expected to be realized with the exception of those which have a valuation allowance.\nThe valuation allowance disclosed in the table above relates to the foreign net operating loss carryforwards and other net deferred tax assets that may not be realized. In fiscal year 2020, we removed $2.0 billion of foreign net operating losses and corresponding valuation allowances as a result of the liquidation of a foreign subsidiary. There was no impact to our consolidated financial statements.\nIncome taxes paid, net of refunds, were $13.4 billion, $12.5 billion, and $8.4 billion in fiscal years 2021, 2020, and 2019, respectively. \n84\n\nPART II\n°Item",
            "°Item 8\n\nChanges in unearned revenue were as follows:\n\n<div>\n<table>\n<tr>\n<td>\n(In millions)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nYear Ended June 30, 2021</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nBalance, beginning of period</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n39,180</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nDeferral of revenue</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n94,565</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nRecognition of unearned revenue</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(89,604</td>\n<td>\n)</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nBalance, end of period</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n44,141</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n</table></div>\n\nRevenue allocated to remaining performance obligations, which includes unearned revenue and amounts that will be invoiced and recognized as revenue in future periods, was $146 billion as of June 30, 2021, of which $141 billion is related to the commercial portion of revenue. We expect to recognize approximately 50% of this revenue over the next 12 months and the remainder thereafter.\nNOTE 14LEASES \nWe have operating and finance leases for datacenters, corporate offices, research and development facilities, Microsoft Experience Centers, and certain equipment. Our leases have remaining lease terms of 1 year to 15 years, some of which include options to extend the leases for up to 5 years, and some of which include options to terminate the leases within 1 year. \nThe components of lease expense were as follows:\n\n<div>\n<table>\n<tr>\n<td>\n(In millions)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nYear Ended June30,</td>\n<td>\n</td>\n<td>\n2021</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n2020</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n2019</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nOperating lease cost</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n2,127</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n2,043</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n1,707</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nFinance lease cost:</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nAmortization of right-of-use assets</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n921</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n611</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n370</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nInterest on lease liabilities</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n386</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n336</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n247</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nTotal finance lease cost</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n1,307</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n947</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n617</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n</table></div>\n\n\nSupplemental cash flow information related to leases was as follows:\n\n<div>\n<table>\n<tr>\n<td>\n(In millions)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nYear Ended June 30,</td>\n<td>\n</td>\n<td>\n2021</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n2020</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n2019</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nCash paid for amounts included in the measurement of lease liabilities:</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nOperating cash flows from operating leases</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n2,052</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n1,829</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n1,670</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nOperating cash flows from finance leases</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n386</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n336</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n247</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nFinancing cash flows from finance leases</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n648</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n409</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n221</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nRight-of-use assets obtained in exchange for lease obligations:</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nOperating leases</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n4,380</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n3,677</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n2,303</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nFinance leases</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n3,290</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n3,467</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n2,532</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n</table></div>\n\n86\n\nPART II\n°Item",
            "°Item 8\n\nNOTE 15  CONTINGENCIES\nPatent and Intellectual Property Claims \nThere were 63 patent infringement cases pending against Microsoft as of June 30, 2021, none of which are material individually or in aggregate. \nAntitrust, Unfair Competition, and Overcharge Class Actions \nAntitrust and unfair competition class action lawsuits were filed against us in British Columbia, Ontario, and Quebec, Canada. All three have been certified on behalf of Canadian indirect purchasers who acquired licenses for Microsoft operating system software and/or productivity application software between 1998 and 2010. \nThe trial of the British Columbia action commenced in May 2016. Following a mediation, the parties agreed to a global settlement of all three Canadian actions and submitted the proposed settlement agreement to the courts in all three jurisdictions for approval. The final settlement and form of notice have been approved by the courts in British Columbia, Ontario, and Quebec. The ten-month claims period commenced on November 23, 2020 and will close on September 23, 2021.\nOther Antitrust Litigation and Claims \nChina State Administration for Market Regulation Investigation \nIn 2014, Microsoft was informed that Chinas State Agency for Market Regulation (SAMR) (formerly State Administration for Industry and Commerce) had begun a formal investigation relating to Chinas Anti-Monopoly Law, and the SAMR conducted onsite inspections of Microsoft offices in Beijing, Shanghai, Guangzhou, and Chengdu. In 2019, the SAMR presented preliminary views as to certain possible violations of Chinas Anti-Monopoly Law.\nProduct-Related Litigation  \nU.S. Cell Phone Litigation \nMicrosoft Mobile Oy, a subsidiary of Microsoft, along with other handset manufacturers and network operators, is a defendant in 46 lawsuits, including 45 lawsuits filed in the Superior Court for the District of Columbia by individual plaintiffs who allege that radio emissions from cellular handsets caused their brain tumors and other adverse health effects. We assumed responsibility for these claims in our agreement to acquire Nokias Devices and Services business and have been substituted for the Nokia defendants. Nine of these cases were filed in 2002 and are consolidated for certain pre-trial proceedings the remaining cases are stayed. In a separate 2009 decision, the Court of Appeals for the District of Columbia held that adverse health effect claims arising from the use of cellular handsets that operate within the U.S. Federal Communications Commission radio frequency emission guidelines (FCC Guidelines) are pre-empted by federal law. The plaintiffs allege that their handsets either operated outside the FCC Guidelines or were manufactured before the FCC Guidelines went into effect. The lawsuits also allege an industry-wide conspiracy to manipulate the science and testing around emission guidelines. \nIn 2013, the defendants in the consolidated cases moved to exclude the plaintiffs expert evidence of general causation on the basis of flawed scientific methodologies. In 2014, the trial court granted in part and denied in part the defendants motion to exclude the plaintiffs general causation experts. The defendants filed an interlocutory appeal to the District of Columbia Court of Appeals challenging the standard for evaluating expert scientific evidence. In October 2016, the Court of Appeals issued its decision adopting the standard advocated by the defendants and remanding the cases to the trial court for further proceedings under that standard. The plaintiffs have filed supplemental expert evidence, portions of which the defendants have moved to strike. In August 2018, the trial court issued an order striking portions of the plaintiffs expert reports. A hearing on general causation is scheduled for January and February of 2022.\n88\n\nPART II\n°Item",
            "°Item 8\n\nWe repurchased the following shares of common stock under the share repurchase programs:\n\n<div>\n<table>\n<tr>\n<td>\n(In millions)</td>\n<td>\n</td>\n<td>\nShares</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nAmount</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nShares</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nAmount</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nShares</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nAmount</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nYear Ended June30,</td>\n<td>\n</td>\n<td>\n2021</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n2020</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n2019</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nFirst Quarter</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n25</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n5,270</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n29 </td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n4,000</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n24</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n2,600</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nSecond Quarter</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n27</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n5,750</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n32</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n4,600</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n57</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n6,100</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nThird Quarter</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n25</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n5,750</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n37</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n6,000</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n36</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n3,899</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nFourth Quarter</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n24</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n6,200</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n28</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n5,088</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n33</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n4,200</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nTotal</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n101</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n22,970</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n126</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n19,688</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n150</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n16,799</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n</table></div>\n\nShares repurchased during fiscal year 2021 and the fourth quarter of fiscal year 2020 were under the share repurchase program approved on September 18, 2019. Shares repurchased during the third quarter of fiscal year 2020 were under the share repurchase programs approved on both September 20, 2016 and September 18, 2019. All other shares repurchased were under the share repurchase program approved on September 20, 2016. The above table excludes shares repurchased to settle employee tax withholding related to the vesting of stock awards of $4.4 billion, $3.3 billion, and $2.7 billion for fiscal years 2021, 2020, and 2019, respectively. All share repurchases were made using cash resources.\nDividends \nOur Board of Directors declared the following dividends: \n\n<div>\n<table>\n<tr>\n<td>\nDeclarationDate</td>\n<td>\nRecordDate </td>\n<td>\n</td>\n<td>\n</td>\n<td>\nPaymentDate </td>\n<td>\n</td>\n<td>\nDividend\nPerShare </td>\n<td>\n</td>\n<td>\n</td>\n<td>\nAmount </td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nFiscal Year 2021</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(Inmillions)</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nSeptember15, 2020</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nNovember19,2020</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nDecember10,2020</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n0.56</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n4,230</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nDecember 2, 2020</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nFebruary 18, 2021</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nMarch 11, 2021</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0.56</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n4,221</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nMarch 16, 2021</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nMay 20, 2021</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nJune 10, 2021</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0.56</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n4,214</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nJune 16, 2021</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nAugust 19, 2021</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nSeptember 9, 2021</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0.56</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n4,211</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nTotal</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n2.24</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n16,876</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nFiscal Year 2020</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nSeptember18, 2019</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nNovember21,2019</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nDecember12,2019</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n0.51</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n3,886</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nDecember 4, 2019</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nFebruary 20, 2020</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nMarch 12, 2020</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0.51</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n3,876</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nMarch 9, 2020</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nMay 21, 2020</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nJune 11, 2020</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0.51</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n3,865</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nJune 17, 2020</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nAugust 20, 2020</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nSeptember 10, 2020</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0.51</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n3,856</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nTotal</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n2.04</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n15,483</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n</table></div>\n\nThe dividend declared on June 16, 2021 was included in other current liabilities as of June 30, 2021. \n\n90\n\nPART II\n°Item",
            "°Item 8\n\nExecutive Incentive Plan \nUnder the Executive Incentive Plan, the Compensation Committee approves stock awards to executive officers and certain senior executives. RSUs generally vest ratably over a service period of four years. PSUs generally vest over a performance period of three years. The number of shares the PSU holder receives is based on the extent to which the corresponding performance goals have been achieved.\nActivity for All Stock Plans \nThe fair value of stock awards was estimated on the date of grant using the following assumptions:\n\n<div>\n<table>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nYear ended June 30,</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n2021</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n2020</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n2019</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nDividends per share (quarterly amounts)</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n0.51</td>\n<td>\n</td>\n<td>\n 0.56</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n0.46</td>\n<td>\n</td>\n<td>\n 0.51</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n0.42</td>\n<td>\n</td>\n<td>\n 0.46</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nInterest rates</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0.01%</td>\n<td>\n</td>\n<td>\n1.5%</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n0.1%</td>\n<td>\n</td>\n<td>\n2.2%</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n1.8%</td>\n<td>\n</td>\n<td>\n3.1%</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n</table></div>\n\nDuring fiscal year 2021, the following activity occurred under our stock plans: \n\n<div>\n<table>\n<tr>\n<td>\nShares</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nWeighted\nAverage\nGrant-Date\nFair Value</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n(Inmillions)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nStock Awards</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nNonvested balance, beginning of year</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n126</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n105.23</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nGranted (a)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n40</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n221.13</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nVested</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(58</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n99.41</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nForfeited</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n(8</td>\n<td>\n)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n129.92</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nNonvested balance, end of year</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n100</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n152.51</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n</table></div>\n\n<div>\n<table>\n<tr>\n<td>\n(a)</td>\n<td>\nIncludes 2 million of PSUs granted at target and performance adjustments above target levels for fiscal years 2021, 2020, and 2019.</td></tr></table></div>\n\nAs of June 30, 2021, there was approximately $12.0 billion of total unrecognized compensation costs related to stock awards. These costs are expected to be recognized over a weighted average period of three years. The weighted average grant-date fair value of stock awards granted was $221.13, $140.49, and $107.02 for fiscal years 2021, 2020, and 2019, respectively. The fair value of stock awards vested was $13.4 billion, $10.1 billion, and $8.7 billion, for fiscal years 2021, 2020, and 2019, respectively. \nEmployee Stock Purchase Plan \nWe have an ESPP for all eligible employees. Shares of our common stock may be purchased by employees at three-month intervals at 90% of the fair market value on the last trading day of each three-month period. Employees may purchase shares having a value not exceeding 15% of their gross compensation during an offering period. Under the terms of the ESPP that were approved in 2012, the plan will terminate on December 31, 2022. We intend to request shareholder approval for a successor ESPP with a January 1, 2022 effective date and ten-year expiration of December 31, 2031 at our 2021 Annual Shareholders Meeting. No additional shares will be requested at this meeting. Employees purchased the following shares during the periods presented: \n\n<div>\n<table>\n<tr>\n<td>\n(Shares in millions)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nYear Ended June30,</td>\n<td>\n</td>\n<td>\n2021</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n2020</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n2019</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nShares purchased</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n8</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n9</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n11</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nAverage price per share</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n207.88</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n142.22</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n104.85</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n</tr>\n</table></div>\n\nAs of June 30, 2021, 88million shares of our common stock were reserved for future issuance through the ESPP. \n92\n\nPART II\n°Item",
            "°Item 8\n\n<div>\n<table>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\nGaming, including Xbox hardware and Xbox content and services, comprising digital transactions, Xbox Game Pass and other subscriptions, video games, third-party video game royalties, cloud services, and advertising. </td></tr></table></div>\n<div>\n<table>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\nSearch advertising. </td></tr></table></div>\nRevenue and costs are generally directly attributed to our segments. However, due to the integrated structure of our business, certain revenue recognized and costs incurred by one segment may benefit other segments. Revenue from certain contracts is allocated among the segments based on the relative value of the underlying products and services, which can include allocation based on actual prices charged, prices when sold separately, or estimated costs plus a profit margin. Cost of revenue is allocated in certain cases based on a relative revenue methodology. Operating expenses that are allocated primarily include those relating to marketing of products and services from which multiple segments benefit and are generally allocated based on relative gross margin. \nIn addition, certain costs incurred at a corporate level that are identifiable and that benefit our segments are allocated to them. These allocated costs include legal, including settlements and fines, information technology, human resources, finance, excise taxes, field selling, shared facilities services, and customer service and support. Each allocation is measured differently based on the specific facts and circumstances of the costs being allocated. Certain corporate-level activity is not allocated to our segments. \nSegment revenue and operating income were as follows during the periods presented:\n\n<div>\n<table>\n<tr>\n<td>\n(In millions)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nYear Ended June30,</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n2021</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n2020</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n2019</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nRevenue</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nProductivity and Business Processes</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n53,915 </td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n46,398</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n41,160</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nIntelligent Cloud</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n60,080 </td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n48,366</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n38,985</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nMore Personal Computing</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n54,093 </td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n48,251</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n45,698</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nTotal</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n168,088 </td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n143,015</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n125,843</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nOperating Income </td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nProductivity and Business Processes</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n24,351 </td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n18,724</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n16,219</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nIntelligent Cloud</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n26,126 </td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n18,324</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n13,920</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nMore Personal Computing</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n19,439 </td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n15,911</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n12,820</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nTotal</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n69,916 </td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n52,959</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n42,959</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n</table></div>\n\nNo sales to an individual customer or country other than the United States accounted for more than 10% of revenue for fiscal years 2021, 2020, or 2019. Revenue, classified by the major geographic areas in which our customers were located, was as follows:\n\n<div>\n<table>\n<tr>\n<td>\n(In millions)</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nYear Ended June30,</td>\n<td>\n</td>\n<td>\n2021</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n2020</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n2019</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nUnited States(a)</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n83,953 </td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n73,160</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n64,199</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nOther countries</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n84,135 </td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n69,855</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n61,644</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nTotal</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n168,088 </td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n143,015</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n$</td>\n<td>\n125,843</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n</table></div>\n\n<div>\n<table>\n<tr>\n<td>\n(a)</td>\n<td>\nIncludes billings to OEMs and certain multinational organizations because of the nature of these businesses and the impracticability of determining the geographic source of the revenue. </td></tr></table></div>\n94\n\nPART II\n°Item",
            "°Item 8\n\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM \nTo the Stockholders and the Board of Directors of Microsoft Corporation \nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Microsoft Corporation and subsidiaries (the \"Company\") as of June 30, 2021 and 2020, the related consolidated statements of income, comprehensive income, cash flows, and stockholders' equity, for each of the three years in the period ended June 30, 2021, and the related notes (collectively referred to as the \"financial statements\"). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of June 30, 2021 and 2020, and the results of its operations and its cash flows for each of the three years in the period ended June 30, 2021, in conformity with accounting principles generally accepted in the United States of America.\nWe have also audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company's internal control over financial reporting as of June 30, 2021, based on criteria established in Internal Control  Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission and our report dated July 29, 2021, expressed an unqualified opinion on the Company's internal control over financial reporting.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company's financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current-period audit of the financial statements that were communicated or required to be communicated to the audit committee and that (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\n\n96\n\nPART II\n°Item",
            "°Item 8\n\nIncome Taxes  Uncertain Tax Positions  Refer to Note 12 to the financial statements\nCritical Audit Matter Description\nThe Company's long-term income taxes liability includes uncertain tax positions related to transfer pricing issues that remain unresolved with the Internal Revenue Service (\"IRS\"). The Company remains under IRS audit, or subject to IRS audit, for tax years subsequent to 2003. While the Company has settled a portion of the IRS audits, resolution of the remaining matters could have a material impact on the Company's financial statements. \nConclusions on recognizing and measuring uncertain tax positions involve significant estimates and management judgment and include complex considerations of the Internal Revenue Code, related regulations, tax case laws, and prior-year audit settlements. Given the complexity and the subjective nature of the transfer pricing issues that remain unresolved with the IRS, evaluating management's estimates relating to their determination of uncertain tax positions required extensive audit effort and a high degree of auditor judgment, including involvement of our tax specialists.\nHow the Critical Audit Matter Was Addressed in the Audit\nOur principal audit procedures to evaluate management's estimates of uncertain tax positions related to unresolved transfer pricing issues included the following:\n<div>\n<table>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\nWe evaluated the appropriateness and consistency of management's methods and assumptions used in the identification, recognition, measurement, and disclosure of uncertain tax positions, which included testing the effectiveness of the related internal controls.</td>\n<td>\n</td></tr></table></div>\n<div>\n<table>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\nWe read and evaluated management's documentation, including relevant accounting policies and information obtained by management from outside tax specialists, that detailed the basis of the uncertain tax positions.</td>\n<td>\n</td></tr></table></div>\n<div>\n<table>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\nWe tested the reasonableness of management's judgments regarding the future resolution of the uncertain tax positions, including an evaluation of the technical merits of the uncertain tax positions.</td>\n<td>\n</td></tr></table></div>\n<div>\n<table>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\nFor those uncertain tax positions that had not been effectively settled, we evaluated whether management had appropriately considered new information that could significantly change the recognition, measurement or disclosure of the uncertain tax positions.</td>\n<td>\n</td></tr></table></div>\n<div>\n<table>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\nWe evaluated the reasonableness of management's estimates by considering how tax law, including statutes, regulations and case law, impacted management's judgments.</td>\n<td>\n</td></tr></table></div>\n\n/s/ DELOITTE TOUCHE LLP\n\nSeattle, Washington\nJuly 29, 2021\n\nWe have served as the Company's auditor since 1983.\n\n\n98\n\nPART II\n°Item"
        ]
    },
    "Item 9": {
        "text": [
            "°Item9.</td>\n<td>\n</td>\n<td>\nChanges in and Disagreements with Accountants on Accounting and Financial Disclosure</td>\n<td>\n</td>\n<td>\n99</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n°Item",
            "°Item 9, 9A\n\n°Item"
        ]
    },
    "Item 9A": {
        "text": [
            "°Item9A.</td>\n<td>\n</td>\n<td>\nControls and Procedures</td>\n<td>\n</td>\n<td>\n99</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nReport of Management on Internal Control over Financial Reporting</td>\n<td>\n</td>\n<td>\n99</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\nReport of Independent Registered Public Accounting Firm</td>\n<td>\n</td>\n<td>\n100</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n°Item",
            "°Item9A. CONTROLS AND PROCEDURES \nUnder the supervision and with the participation of our management, including the Chief Executive Officer and Chief Financial Officer, we have evaluated the effectiveness of our disclosure controls and procedures as required by Exchange Act Rule 13a-15(b) as of the end of the period covered by this report. Based on that evaluation, the Chief Executive Officer and Chief Financial Officer have concluded that these disclosure controls and procedures are effective. \nREPORT OF MANAGEMENT ON INTERNAL CONTROL OVER FINANCIAL REPORTING \nOur management is responsible for establishing and maintaining adequate internal control over financial reporting for the Company. Internal control over financial reporting is a process to provide reasonable assurance regarding the reliability of our financial reporting for external purposes in accordance with accounting principles generally accepted in the United States of America. Internal control over financial reporting includes maintaining records that in reasonable detail accurately and fairly reflect our transactions providing reasonable assurance that transactions are recorded as necessary for preparation of our consolidated financial statements providing reasonable assurance that receipts and expenditures of company assets are made in accordance with management authorization and providing reasonable assurance that unauthorized acquisition, use, or disposition of company assets that could have a material effect on our consolidated financial statements would be prevented or detected on a timely basis. Because of its inherent limitations, internal control over financial reporting is not intended to provide absolute assurance that a misstatement of our consolidated financial statements would be prevented or detected. \nManagement conducted an evaluation of the effectiveness of our internal control over financial reporting based on the framework in Internal Control  Integrated Framework (2013)issued by the Committee of Sponsoring Organizations of the Treadway Commission. Based on this evaluation, management concluded that the Companys internal control over financial reporting was effective as of June 30, 2021. There were no changes in our internal control over financial reporting during the quarter ended June 30, 2021 that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting. Deloitte Touche LLP has audited our internal control over financial reporting as of June 30, 2021 their report is included in Item9A. \n\n\n99\n\nPART II\n°Item"
        ]
    },
    "Item 9B": {
        "text": [
            "°Item9B.</td>\n<td>\n</td>\n<td>\nOther Information</td>\n<td>\n</td>\n<td>\n101</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\nPARTIII</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n°Item",
            "°Item 9B, 10, 11, 12, 13, 14\n\n°Item"
        ]
    },
    "Item 10": {
        "text": [
            "°Item10.</td>\n<td>\n</td>\n<td>\nDirectors, Executive Officers and Corporate Governance</td>\n<td>\n</td>\n<td>\n101</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n°Item",
            "°Item10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE \nA list of our executive officers and biographical information appears in Part I, Item1 of this Form 10-K. Information about our directors may be found under the caption Our director nominees in our Proxy Statement for the Annual Meeting of Shareholders to be held November 30, 2021 (the Proxy Statement). Information about our Audit Committee may be found under the caption Board committees in the Proxy Statement. That information is incorporated herein by reference. \nWe have adopted the Microsoft Finance Code of Professional Conduct (the finance code of ethics), a code of ethics that applies to our Chief Executive Officer, Chief Financial Officer, Chief Accounting Officer, and other finance organization employees. The finance code of ethics is publicly available on our website at https://aka.ms/FinanceCodeProfessionalConduct. If we make any substantive amendments to the finance code of ethics or grant any waiver, including any implicit waiver, from a provision of the code to our Chief Executive Officer, Chief Financial Officer, or Chief Accounting Officer, we will disclose the nature of the amendment or waiver on that website or in a report on Form8-K. \n°Item"
        ]
    },
    "Item 11": {
        "text": [
            "°Item11.</td>\n<td>\n</td>\n<td>\nExecutive Compensation</td>\n<td>\n</td>\n<td>\n101</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n°Item",
            "°Item11. EXECUTIVE COMPENSATION \nThe information in the Proxy Statement set forth under the captions Director compensation, Named executive officer compensation, Compensation Committee report, and, if required, Compensation Committee interlocks and insider participation, is incorporated herein by reference. \n°Item"
        ]
    },
    "Item 12": {
        "text": [
            "°Item12.</td>\n<td>\n</td>\n<td>\nSecurity Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters</td>\n<td>\n</td>\n<td>\n101</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n°Item",
            "°Item12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS \nThe information in the Proxy Statement set forth under the captions Stock ownership information, Principal shareholders and Equity compensation plan information is incorporated herein by reference. \n°Item"
        ]
    },
    "Item 13": {
        "text": [
            "°Item13.</td>\n<td>\n</td>\n<td>\nCertain Relationships and Related Transactions, and Director Independence</td>\n<td>\n</td>\n<td>\n101</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n<td>\n</td>\n</tr>\n<tr>\n<td>\n</td>\n<td>\n</td>\n<td>\n°Item",
            "°Item13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTORINDEPENDENCE \nThe information set forth in the Proxy Statement under the captions Director independence and Certain relationships and related transactions is incorporated herein by reference. \n°Item"
        ]
    },
    "Item 14": {
        "text": [
            "°Item",
            "°Item"
        ]
    }
}